{
  "intents": [
        {
"tag": "greetings",
  "patterns": [
    "Hello","Hi","Hey","Good morning","Good afternoon","Good evening","Hi there","Greetings","What's up","How are you",
    "Hello bot","Hey there","Morning","Afternoon","Evening","Hi UCU bot","Hey UCU","Hello there","Yo","Good day",
    "Hi assistant","Hey assistant","Wagwan","Heyo","Salutations","Hi friend","Good to see you","What's good",
    "Hey buddy","Hello student","Hi student","Greetings UCU","Hey hi","Hi there mate","Good day UCU"
  ],
  "responses": [
    "Hello! God bless you. How can I assist you today at UCU?",
    "Hi there! Welcome back. What do you need help with?",
    "Hey! Great to see a UCU student. How may I serve you today?",
    "Good morning! Hope you're having a blessed day on campus.",
    "Hi! I'm here to help with anything UCU-related.",
    "Hello! The Lord bless you. How can I support you?",
    "Hey! Ready to answer your questions — fire away!",
    "Good afternoon! How can I make your day better?",
    "Hello there! What would you like to know about UCU?"
  ]
    },
    {
    "tag": "quit",
  "patterns": [
    "quit","exit","leave","bye","goodbye","I'm done","close","stop chat","end session","see you",
    "good night","I have to go","talk later","end conversation","stop","finish","later","bye bye",
    "I'm leaving","end chat","that's all","see you later","got to go","farewell","peace out","take care"
  ],
  "responses": [
    "Goodbye! God bless you richly. Come back anytime!",
    "See you later! Stay blessed and keep studying hard.",
    "Bye! Have a peaceful and fruitful day at UCU.",
    "Session ended. May the Lord be with you!",
    "Take care! You're always welcome back. Blessings!",
    "Goodbye! Wishing you success in your studies.",
    "Bye for now! See you soon on campus.",
    "God bless you! Talk to you later."
  ]
    },
    {
     "tag": "campus_map",
  "patterns": [
    "Locate the Chapel in UCU's campus",
    "Directions to Nkoyoyo Hall at UCU",
    "Which block is N-Block at UCU",
    "Where is the M-Block lecture hall at UCU",
    "How to find K-Block on UCU campus",
    "Where is the Janan Luwum Dining Hall at UCU",
    "Show me the UCU Mukono campus map",
    "Where is the UCU central administration building",
    "Where are the student halls in UCU campus",
    "How to get to the UCU library (Ham Mukasa)",
    "Where is the UCU sports complex located",
    "Where is the UCU gym building",
    "Directions to Technology Park building at UCU",
    "Where is the Finance Office on UCU campus",
    "How do I walk from the main gate to the library in UCU",
    "Where is the UCU dean of students' office",
    "Where is Suubi block in UCU campus",
    "How to reach Nsibambi Hall at UCU",
    "Where is the Maari Lecture Block (M-Block)",
    "Where is the Kivengere Lecture Block (K-Block)",
    "How to find the campus dining hall at UCU",
    "Where is the chapel located",
    "Where is the outpatient clinic at UCU main campus",
    "Where is the UCU students' guild building located",
    "Directions from the library to Nkoyoyo Hall",
    "How to reach the UCU academic offices from the gate",
    "Where is the UCU student canteen building",
    "Where is the UCU chapel for weekly worship services",
    "Where is UCU's main classroom building M-Block",
    "How to locate the UCU security gate house on campus map",
    "How to walk to Nkoyoyo Hall from library",
    "On the UCU map, where is the gym/sports building",
    "How to reach the UCU chapel from M-Block"
  ],
  "responses": [
    "Here’s the official UCU Mukono Campus Map: https://ucu.ac.ug/ucu-buildings/ptucker/",
    "From the main gate: Bishop Tucker Building (with the Chapel) is the first big building you see.",
    "Ham Mukasa Library is right in the centre of campus — walk straight past Bishop Tucker.",
    "Nkoyoyo Hall (ladies’ hostel) is just downhill from the dining hall.",
    "Nsibambi & Sabiiti Halls (men’s hostels) are behind the dining hall area.",
    "Janan Luwum Dining Hall is the big cafeteria — you’ll smell the food!",
    "M-Block (Maari) & K-Block (Kivengere) are the two main lecture blocks side by side.",
    "N-Block (Noll) is the tall computer lab and lecture building next to them.",
    "Allan Galpin Health Centre is between the hostels and lecture blocks — short walk from dining hall.",
    "Sports Complex & Gym are behind Technology Park — follow the road past the hostels.",
    "Guild Building is near the dining hall and sports ground.",
    "Finance Office is in the orange Administration Block below Nkoyoyo Hall.",
    "Dean of Students & Registrar are in Bishop Tucker Building.",
    "Technology Park (computing & engineering) is near the back gate and sports area.",
    "Need step-by-step directions from one place to another? Just tell me start and end point — I’ll guide you!"
  ]
    },
    {
      "tag": "alan_galpin_location",
      "patterns": [
        "Where is Allan Galpin Health Centre at UCU",
        "Where is Alan Galphin Health Center located",
        "How do I get to the UCU health centre on campus",
        "Directions to Allan Galpin clinic at UCU",
        "Which block is Allan Galpin Health Centre next to",
        "How far is Allan Galpin Health Centre from Janan Luwum Dining Hall"
      ],
      "responses": [
        "Allan Galpin Health Centre sits between the student residential halls and the main lecture blocks, a short walk downhill from Janan Luwum Dining Hall.",
        "From the main gate, walk past Bishop Tucker Building toward Nkoyoyo Hall; the Allan Galpin clinic is on the left opposite the student hostels before you reach N-Block.",
        "Follow the signs for student health services — the Allan Galpin outpatient wing is behind the dining hall beside the student affairs offices."
      ]
    },
    {
      "tag": "bishop_tucker_building",
      "patterns": [
        "Where is Bishop Tucker Building at UCU",
        "How do I get to Bishop Tucker Building",
        "Directions to the Bishop Tucker administration block",
        "Which offices are inside Bishop Tucker Building",
        "Where is the Vice Chancellor's office located on campus",
        "Where is the UCU chapel inside Bishop Tucker Building"
      ],
      "responses": [
        "Bishop Tucker Building is the first major block after the main gate; it anchors the chapel on one side and houses the Vice Chancellor's office plus key administrative units.",
        "Walk straight from the main entrance into the central courtyard—the stone Bishop Tucker Building sits opposite the chapel and hosts the VC, Dean of Students, and registries.",
        "Think of Bishop Tucker as campus headquarters: the chapel is at its heart, with guild, deanery, and senior management offices in the surrounding wings."
      ]
    },
    {
      "tag": "library_services",
  "patterns": [
    "How many levels does the Ham Mukasa Library have",
    "Can students borrow books from UCU Library",
    "How long can I keep a book borrowed from UCU Library",
    "Does UCU have e-books in its library system",
    "Can I access UCU's digital repository from the library",
    "What is the procedure to renew books at UCU Library",
    "Is there a penalty for late return of books at UCU",
    "How much is the fine for late return in UCU Library",
    "Does UCU Library use Koha system",
    "How to login to UCU Koha library system",
    "Can I reserve a book in UCU Library through Koha",
    "How many books can I borrow as an undergraduate at UCU",
    "Is there a limit on the number of books you borrow from UCU Library",
    "How to book a discussion room in UCU Library",
    "Does UCU Library have seminar rooms for students",
    "Can I scan documents in the UCU Library",
    "Is there a scanner in UCU Library",
    "Can I print documents in the UCU Library",
    "How much does it cost to print in UCU Library",
    "Does UCU Library have Wi-Fi for students",
    "Can I connect to eduroam from inside UCU Library",
    "Does the UCU Library have computers for students",
    "Where are the computer labs in UCU Library",
    "Does the library have group-study sections at UCU",
    "How to book group study space in UCU Library",
    "Where is the Uganda Collection in the UCU Library",
    "Are past exam papers stored in UCU Library",
    "How to access past exam papers from UCU's library collection",
    "Does UCU have an archival library section",
    "Is the UCU institution repository accessible via library",
    "How many volumes of books are in UCU Library",
    "How many study spaces are available in UCU Library",
    "Are there silent reading rooms in UCU Library",
    "Can final-year students reserve a special library room at UCU",
    "Does UCU Library have reference librarians",
    "Can I ask a librarian for help at UCU Library",
    "Are there library orientation sessions for UCU students",
    "Does UCU Library lend laptops or tablets",
    "Can staff borrow books from UCU Library",
    "How long can staff keep library books at UCU",
    "Do alumni have access to UCU Library resources",
    "Does UCU Library provide access to academic journals",
    "How to access JSTOR or EBSCO via UCU Library",
    "Does UCU Library provide printing for theses",
    "Can you photocopy in the UCU Library",
    "Where to return borrowed books in UCU Library",
    "Is there a drop-box for returning books at UCU Library",
    "Can I donate a book to the UCU Library",
    "Are there orientation guides for UCU Library on how to use the system",
    "Does UCU Library have an online catalogue",
    "How to search for books in UCU's library online catalogue",
    "Is there inter-library loan service at UCU Library",
    "Can I access UCU's library from off-campus",
    "How to remote login to UCU library database",
    "How many computers are there in Ham Mukasa Library",
    "Is there a reading terrace in UCU Library",
    "Can I study overnight in the UCU Library",
    "Does UCU Library allow group tutoring sessions",
    "Are there printer-friendly zones in UCU Library",
    "Does UCU host library workshops or training sessions",
    "Does UCU Library run research training for students",
    "Can I consult UCU librarians for thesis help",
    "Does the UCU Library have video-tutorials on how to use Koha",
    "Is food allowed in the UCU Library",
    "Are drinks allowed in UCU Library",
    "How to renew reserved books in UCU Library",
    "What to do when a book is not available in UCU Library",
    "How to request books for UCU Library acquisition",
    "Does UCU Library stock older course textbooks",
    "Does UCU have a library for theological studies",
    "Where is the theological books section in UCU Library",
    "How to access archived UCU publications in the library",
    "How to register for a library account at UCU",
    "What details are needed to open a library account at UCU",
    "Is the library card required to borrow from UCU Library"
  ],
  "responses": [
    "Ham Mukasa Library has 3 beautiful floors full of resources — welcome!",
    "Yes! Undergraduates can borrow up to 6 books for 14 days. Renew online via Koha.",
    "Use your student number + default password (date of birth: ddmmyyyy) to log into Koha: https://koha.ucu.ac.ug",
    "Renew books online up to 2 times if no one has reserved them. Easy!",
    "Late fine: UGX 500 per day per book — check your Koha account to avoid surprises!",
    "Discussion/seminar rooms: Book at the circulation desk or online (first-come, first-served).",
    "Free printing & scanning available in the ICT corner — bring your student ID.",
    "Strong eduroam Wi-Fi everywhere + 70+ computers for your use.",
    "Past exam papers → Uganda Collection, Ground Floor. Ask the librarian!",
    "JSTOR, EBSCO, Emerald, etc. → Access via library website with your UCU login.",
    "UCU Institutional Repository: https://repository.ucu.ac.ug — theses, journals, past papers.",
    "Silent reading rooms on 2nd floor — perfect for deep focus and prayerful study.",
    "Group study zones available — book early during exam season!",
    "Theological books section is on the 1st floor — one of the best in East Africa!",
    "Need a book we don’t have? Fill the acquisition request form at the desk — we love suggestions!",
    "Reference librarians are always ready to help — just ask at any counter!",
    "Library orientation happens every semester — highly recommended for freshers!",
    "Water is allowed (in transparent bottles). Food is not — let’s keep the books safe!",
    "Drop box at the entrance — return books even when library is closed.",
    "Alumni can access e-resources and reading rooms with an alumni card.",
    "Laptops/tablets not loaned, but plenty of power sockets and desktop computers.",
    "Final-year students get priority for postgraduate reading room on 3rd floor.",
    "Yes — we run free workshops on Koha, research skills, Zotero, and more!",
    "Remote access to all databases — just log in with your UCU email from anywhere.",
    "Your student ID card is your library card — keep it safe!",
    "Reading terrace on the top floor — quiet, breezy, and inspiring!",
    "Need help with your thesis? Our librarians offer one-on-one research consultations.",
    "Overnight study allowed during revision week — check library notices!",
    "Yes — group tutoring allowed in booked seminar rooms (max 10 people).",
    "You can donate books! Bring them to the circulation desk — we’ll be grateful!"
  ]
    },
    {
      "tag": "library_hours",
      "patterns": [
        "What are UCU's library operating hours",
        "When is Ham Mukasa Library open on campus",
        "How late is the library open at UCU on Friday",
        "Is UCU Library open on Saturday",
        "What time does the UCU Library close on weekdays",
        "When does the library close during exam week",
        "Does Ham Mukasa Library open on Sunday"
      ],
      "responses": [
        "Regular semester schedule: Mon–Thu 08:00–22:00, Fri 08:00–20:00, Sat 09:00–17:00; the library is closed on Sundays except during revision weeks.",
        "During exams, Ham Mukasa Library usually extends hours up to midnight—watch the library noticeboard or Koha banner for any special updates.",
        "Public holidays follow the university closure calendar, so confirm on the library WhatsApp alert before heading over."
      ]
    },
    {
      "tag": "vice_chancellor_info",
      "patterns": [
        "Who is the current Vice Chancellor of UCU",
        "What is the name of UCU's Vice Chancellor",
        "Who heads UCU academically",
        "Who guides UCU's academic vision",
        "Who leads Uganda Christian University administration",
        "Who is the chief executive of UCU"
      ],
      "responses": [
        "Assoc. Prof. Aaron Mushengyezi is the current Vice Chancellor of Uganda Christian University.",
        "The Vice Chancellor, Assoc. Prof. Aaron Mushengyezi, is the chief academic and administrative officer of UCU.",
        "You can reach the VC's office in Bishop Tucker Building for official matters related to university leadership."
      ]
    },
    {
      "tag": "who_is",
      "patterns": [
        "Who is DVC Academic Affairs at UCU",
        "Who is UCU's Deputy Vice Chancellor for Finance",
        "Who is the Academic Registrar of Uganda Christian University",
        "Who is the Dean of Engineering at UCU",
        "Who is the Dean of Theology at UCU",
        "Who leads the School of Computing & IT at UCU",
        "Who is the head of the Chaplaincy at UCU",
        "Who is the University Bursar at UCU",
        "Who is the Guild President of UCU in 2025",
        "Who is the Chancellor of UCU",
        "Who is the University Secretary at UCU",
        "Who is the Pro-Vice Chancellor or principal at UCU",
        "Who founded Uganda Christian University",
        "Who was the first vice chancellor at UCU",
        "Who is the Dean of Students at UCU",
        "Who is the Director of ICT at UCU",
        "Who is in charge of student affairs at UCU",
        "Who is the head of Admin at UCU",
        "Who is the principal of the Theology school at UCU",
        "Who is the person in charge of alumni relations at UCU",
        "Who runs the University Council at UCU",
        "Who is managing student discipline at UCU",
        "Who handles UCU's external relations leadership",
        "Who is on the board of trustees at UCU",
        "Who leads the UCU academic senate",
        "Who is the head of human resources at UCU",
        "Who is responsible for UCU's financial planning",
        "Who supervises UCU's physical infrastructure",
        "Who is UCU's senior pastor or faith leader within administration (if any)",
        "Who is the person responsible for student welfare at UCU",
        "Who is the top Christian leader at UCU management",
        "Who leads UCU's research office",
        "Who oversees postgraduate studies at UCU",
        "Who is UCU's director of admissions",
        "Who is UCU's head of quality assurance",
        "Who is the Dean of Business Faculty at UCU",
        "Who is the Dean of Law Faculty at UCU",
        "Who heads the Scholars of UCU",
        "Who is the person managing UCU's library services (chief librarian)",
        "Who is UCU's head of marketing / communications",
        "Who is in charge of UCU's finance directorate",
        "Who is the principal of UCU's school of medicine (if present)",
        "Who is the coordinator for UCU chaplaincy events",
        "Who is the head of student chaplains at UCU",
        "Who is the person responsible for UCU's community service programs",
        "Who is the head of UCU's postgraduate research office",
        "Who is the person in charge of UCU's ICT internships",
        "Who is UCU's managing director for campus operations",
        "Who is UCU's student life director",
        "Who is UCU's coordinator for guild ministries",
        "Who is UCU's electoral commission chair during Guild elections",
        "Who leads the UCU student parliament (if exists)",
        "Who is UCU's director of admission and enrollment",
        "Who is UCU's head of data protection / privacy",
        "Who is UCU's advancement or fundraising leader",
        "Who is in charge of UCU's campus expansion projects",
        "Who is UCU's alumni director",
        "Who is UCU's chaplain for interdenominational worship",
        "Who heads UCU's counseling center",
        "Who is the counselor-in-chief at UCU",
        "Who is UCU's vice principal for student development",
        "Who is UCU's lead for entrepreneurship programs / guild marketing",
        "Who is UCU's supervisor for student internships",
        "Who is the founding chancellor of UCU",
        "Who is the person that oversees UCU's ethical and spiritual life",
        "Who heads the UCU Legal Office",
        "Who is UCU's Chief Librarian",
        "Who is the UCU Vice Chancellor's special assistant",
        "Who is UCU's head of procurement",
        "Who is leading UCU's career development office",
        "Who is UCU's director of student engagement",
        "Who is UCU's director of ICT training",
        "Who is UCU's head of faculty of design",
        "Who is UCU's academic dean for theology",
        "Who is UCU's student disciplinary committee head",
        "Who is responsible for UCU's spiritual mentorship programs"
      ],
      "responses": [
        "DVC Academic Affairs at UCU is Rev. Prof. John Kitayimbwa.",
        "DVC Finance & Administration: Mr. David Mugawe.",
        "Academic Registrar: Mrs. Anny Katabaazi.",
        "The Dean of Engineering (Design & Computing) is Eng. Dr. Stephen Kyakulumbye.",
        "Head of Computing and IT: Mr. Swaib Kyanda.",
        "The University Chaplain is Rev. Canon Capt. Titus Baraka.",
        "The University Bursar is CPA Geoffrey Namazzi.",
        "The Chancellor of UCU is Stephen Kaziimba.",
        "University ICT Services (UIS) is run centrally and provides technical support to students and staff.",
        "You can reach the UIS helpdesk by calling +256 312 350816 or emailing helpdesk@ucu.ac.ug.",
        "UIS leads innovation, network services, and cloud infrastructure at UCU.",
        "The person in charge of student affairs and chaplaincy is typically the Chaplaincy director.",
        "UCU's spiritual and Christian identity is embedded in its leadership, including Chaplaincy and Guild ministries.",
        "The Dean of Students handles student welfare, discipline, and hall affairs.",
        "The head of Alumni Relations manages the alumni office and engagement activities.",
        "The Director of Admissions manages enrollment, applications, and entry procedures.",
        "UCU's Director of Quality Assurance ensures academic standards across programs.",
        "The head of infrastructure oversees campus building development and maintenance.",
        "The Head of Research Office supervises postgraduate research and innovation.",
        "The person leading student internships coordinates with faculties and external partners.",
        "The Guardian of spiritual mentorship programs helps students grow in Christian values.",
        "Legal Office head handles compliance, contracts, and governance at UCU.",
        "The Director of Student Engagement plans events, guild activities, and student leadership.",
        "The person in charge of Councils or Boards of Trustees participates in long-term strategy.",
        "The founding Chancellor of UCU helped establish the university's Christian mission.",
        "The Dean of Theology leads the Bishop Tucker School of Divinity & Theology.",
        "The Academic Registrar is responsible for academic records, registration, and transcripts.",
        "The Data Protection / Privacy Officer ensures student information is handled responsibly.",
        "The Student Disciplinary Committee chair oversees student behavior and code of conduct.",
        "The Career Development Office is led by a director who helps with internships and job placements.",
        "The head of procurement handles procurement of services, assets, and university supplies.",
        "The head of ICT training arranges digital literacy workshops for staff and students.",
        "The Director of Fundraising / Advancement builds partnerships and donor relations.",
        "The Student Life Director oversees guild, ministry, and extracurricular programs.",
        "The Dean of Business Faculty is responsible for the School of Business and Management.",
        "The Chancellor represents UCU at ceremonial and governance functions.",
        "Student welfare, discipline, and support are coordinated by the Dean of Students.",
        "Spiritual mentorship is part of UCU's identity; the Chaplaincy leads mentorship among students."
      ]
    },
      {
 "tag": "course_information",
  "patterns": [
    "Which undergraduate programmes does UCU offer?",
    "What courses can I study at UCU in Business?",
    "Does UCU have a Bachelor of Science in Computer Science?",
    "Tell me about the Diploma in Information Technology at UCU",
    "What are the entry requirements for BBA at UCU?",
    "How long does the Bachelor of Business Administration last at UCU?",
    "Is there a Master of Information Technology at UCU?",
    "Which engineering degrees are offered at UCU?",
    "Does UCU School of Medicine have a Bachelor of Medicine and Surgery?",
    "What theology programmes does UCU provide?",
    "How many credits are needed for a BSCS at UCU?",
    "What core courses do IT students take at UCU?",
    "Are there elective courses in UCU’s Business degree?",
    "Where can I find the UCU course syllabus?",
    "What is the course structure for the Bachelor of Public Health at UCU?",
    "Which courses require prerequisites at UCU?",
    "Does UCU offer weekend or evening degree programmes?",
    "Can I do a certificate course in project management at UCU?",
    "What professional short courses does UCU run?",
    "Does UCU have a Master of Business Administration (MBA)?",
    "What postgraduate programmes are available in Theology at UCU?",
    "Where do I check the course catalogue for UCU?",
    "How can I withdraw from a course after registering at UCU?",
    "What assessment methods are used in UCU courses?",
    "Does UCU require students to do a thesis or final project?",
    "Which UCU programmes include internship courses?",
    "How can I view course descriptions for UCU programs?",
    "What is the grading system for UCU undergraduate courses?",
    "Where can I find UCU course materials and recommended textbooks?",
    "Can I study in the UCU School of Social Sciences?",
    "What are the available diplomas in UCU Business School?",
    "Does UCU offer a PhD programme?",
    "What research courses does UCU have for postgraduate students?",
    "Does UCU teach data science and analytics?",
    "Is there a civil engineering degree at UCU?",
    "How much time does a UCU Bachelor degree take?",
    "Are there short professional courses in Health Sciences at UCU?",
    "Can I apply for a certificate in First Aid or Health Informatics at UCU?",
    "Does UCU offer courses in journalism or mass communication?",
    "Where on the UCU website do I find programme details?",
    "Which UCU courses are available in the School of Law?",
    "What is in the syllabus for BS Accounting & Finance at UCU?",
    "Can UCU students take elective courses in entrepreneurship?",
    "How do I check the UCU course schedule for next semester?",
    "What laboratory courses are there for science students at UCU?",
    "Does UCU offer weekend or distance learning courses?",
    "What postgraduate diploma courses are available at UCU?"
  ],
  "responses": [
    "UCU offers over 70 programmes across 7 faculties: Business, IT & Engineering, Law, Medicine, Theology, Social Sciences, Education, and Public Health.",
    "Yes! We have Bachelor of Science in Computer Science (BSc CS) and Bachelor of Science in Data Science & Analytics.",
    "BBA (Bachelor of Business Administration) takes 3 years full-time. Evening/weekend option also available.",
    "Entry for BBA: Minimum two principal passes (e.g. Economics, Maths, Entrepreneurship) + credit in Maths at O-Level.",
    "Yes — we offer Master of Information Technology (MIT), MBA, Master of Public Health, and many more postgraduate degrees.",
    "Engineering: BSc Civil & Environmental Engineering and BSc Electronics & Communication Engineering.",
    "School of Medicine offers Bachelor of Medicine & Bachelor of Surgery (MBChB) — 5 years + 1 year internship.",
    "Bishop Tucker School of Divinity & Theology offers Bachelor of Divinity, MA Theology, and PhD in Theology.",
    "Yes — we have a strong Bachelor of Laws (LLB), Bachelor of Journalism & Communication, and Bachelor of Social Work & Social Administration.",
    "All undergraduate degrees are 3 years except Medicine (5+1), Nursing (4), and Pharmacy (4).",
    "Most programmes include a mandatory internship/recitation in Year 2 or 3 — especially IT, Business, Engineering, and Health Sciences.",
    "Yes — we offer evening and weekend classes in Business, Education, and some IT programmes.",
    "We run professional short courses: Project Management, First Aid, Health Informatics, Digital Marketing, Procurement, etc.",
    "PhD programmes available in Theology, Education, Business, and more coming soon.",
    "Yes — Civil & Environmental Engineering is offered (4 years).",
    "BSc Data Science & Analytics is one of our newest and most popular programmes!",
    "Postgraduate diplomas: Human Resource Management, Public Health, Christian Ministries, Sustainable Business, etc.",
    "Course catalogue & detailed syllabi: https://ucu.ac.ug/academics/programmes/",
    "Moodle has all lecture notes, slides, and recommended textbooks once you’re registered.",
    "Grading: A (80–100), B+ (75–79), B (70–74) … down to F (<40). GPA 4.40–5.00 = First Class.",
    "Most final-year students do a research project or thesis — especially in Sciences, Business, IT, and Social Sciences.",
    "Entrepreneurship, Ethics, and Christian Worldview are popular electives across faculties.",
    "You can withdraw/add courses within the first 3 weeks of semester via Alpha portal.",
    "Assessment: Coursework 40%, Final exam 60% (typical). Some courses have 100% coursework.",
    "Yes — Mass Communication & Journalism is offered under the Faculty of Journalism, Media & Communication.",
    "Need the exact timetable? Log into Alpha → Registration → Timetable for next semester.",
    "Lab courses: Physics, Chemistry, Biology, Computer Labs, Engineering Workshops, Nursing Skills Lab.",
    "Distance/blended learning (ODeL) available in some postgraduate and short courses.",
    "Accounting & Finance (BSAF) covers Financial Accounting, Auditing, Taxation, Management Accounting, and more.",
    "Theological library section is excellent — perfect for Divinity students!",
    "Want to know more about a specific programme? Just mention the name — I’ll give you full details!",
    "New in 2025: Bachelor of Software Engineering and Bachelor of Nursing Science (Direct Entry).",
    "Scholarships available for Medicine, Engineering, and high-performing students — apply early!",
    "All programmes include compulsory Christian Ethics and Development Studies courses — that’s the UCU difference!",
    "Still undecided? Come for career guidance at the Student Centre — we’d love to help you choose!",
    "God has a great plan for your studies here at UCU — which programme is He calling you to?"
  ]
},
    {
      "tag": "tech_events",
      "patterns": [
        "When is UCU Technology Week held",
        "What is UCU Tech Week about",
        "Does UCU host a UIS week event",
        "How to join UCU Tech Week workshops",
        "Are there cybersecurity sessions during UCU tech week",
        "Does UCU organize a laptop clinic each Tech Week",
        "How to register for UCU Technology Week",
        "What topics are covered in UCU's Tech Week",
        "Is there cloud computing training in UCU Tech Week",
        "Where is Tech Week happening on UCU campus",
        "How many days is Tech Week at UCU",
        "Does UCU Tech Week include Moodle tutorials",
        "Does UIS teach how to use Alpha MIS at Tech Week",
        "Are there IoT demonstrations at UCU Tech Week",
        "Can I attend UCU Tech Week as a first-year student",
        "Do alumni participate in UCU's Technology Week",
        "Who organizes UCU's Tech Week events",
        "Is there a student competition in UCU Technology Week",
        "Does Tech Week have hackathons at UCU",
        "Are there free swag items during UCU Tech Week",
        "Are there guest speakers at UCU Technology Week",
        "Is there networking with companies during UCU Tech Week",
        "Does UCU Tech Week provide certificates for participants",
        "How to volunteer at UCU Tech Week",
        "Does Tech Week help with internship opportunities at UCU",
        "Does UCU Tech Week include talks on eduroam and Wi-Fi",
        "Can I learn about UCU cloud services in Tech Week",
        "Do professors present research during UCU Tech Week",
        "Are there student start-up booths at UCU Tech Week",
        "Is UCU Tech Week held every semester",
        "What is the theme of UCU Technology Week this year",
        "Is there Alpha training in UCU Tech Week",
        "Can I learn about Microsoft 365 during UCU Tech Week",
        "Do they teach digital security at UCU Tech Week",
        "Where do I sign up for UCU Tech Week",
        "Are there UI/UX workshops at UCU Technology Week",
        "Can I bring my device for check-up during UCU Tech Week",
        "Are there mentorship sessions in Tech Week",
        "Does UCU Tech Week cover data science topics",
        "Are there robotics competitions at UCU Tech Week",
        "Are there free classes on using M365 during UCU Tech Week",
        "Does UCU invite tech companies to Tech Week",
        "Are there resume clinics at UCU Technology Week",
        "Does UCU teach about cloud computing and AI in Tech Week",
        "Does UCU host guest programmers or alumni at Tech Week",
        "Does UCU Tech Week have cybersecurity certification sessions",
        "How to access Tech Week schedule on UCU portal",
        "Do I need to pay for UCU Tech Week attendance",
        "Are there student projects displayed at UCU Tech Week",
        "Is there a data science bootcamp during UCU Tech Week",
        "Can I propose a talk for UCU Tech Week",
        "Are there hackathon prizes at UCU Tech Week",
        "Do first-year students get priority for Tech Week workshops",
        "How to get notified about Tech Week events",
        "Is UCU Technology Week only for computing students",
        "Does UCU Tech Week have panel discussions",
        "Is the UCU Tech Week recorded for students who miss sessions",
        "Can remote students join UCU Tech Week online",
        "Does UCU run an app dev contest during Tech Week",
        "Are there Q&A sessions with tech staff at UCU during Tech Week",
        "Do UCU faculty teach about student portal (Alpha) in Tech Week",
        "Are there Wi-Fi security lessons in UCU Tech Week",
        "How important is UCU Tech Week for computer science students",
        "Does UCU Tech Week include digital marketing sessions",
        "Are there refreshment booths during UCU Tech Week",
        "Do I need to register via UIS to attend UCU Tech Week",
        "Are there alumni panels speaking about startups in UCU Tech Week",
        "What is the cost of UCU's Tech Week (if any)",
        "Are there design thinking workshops in UCU Tech Week",
        "Who can attend UCU Technology Week – staff & students"
      ],
      "responses": [
        "UCU Technology Week is organized by University ICT Services (UIS) to promote digital literacy and innovation.",
        "You can join UCU Tech Week workshops for free — check UIS announcements on the student portal.",
        "During UCU Tech Week, there are cyber-security sessions, cloud computing classes, and Alpha MIS tutorials.",
        "The laptop clinic during Tech Week helps students check and optimize their devices.",
        "Alpha MIS training is part of Tech Week so that you can learn registration, results, and portal features.",
        "There are practical labs, hackathons, and networking booths during UCU Technology Week.",
        "UIS brings in alumni and tech companies to speak and mentor students during the week.",
        "Many students receive certificates at the end of Tech Week for attending workshops.",
        "If you volunteer, you may help run sessions, mentor, or assist with registrations.",
        "Tech Week is held on the Mukono campus, often around the library courtyard and Technology Park.",
        "You can learn about eduroam, OneDrive, Teams, and other digital tools during Tech Week.",
        "A data-science bootcamp is sometimes offered during UCU Tech Week.",
        "UIS offers cloud computing sessions, AI explorations, and startup mentorship during Tech Week.",
        "There are resume clinics and interview prep sessions as part of UCU Tech Week events.",
        "Hackathons and student project displays take place during UCU Technology Week.",
        "Remote students can join some Tech Week activities via online links shared by UIS.",
        "You don't have to pay for UCU Tech Week — many sessions are free for students.",
        "UIS shares the Tech Week schedule on the student portal and via email before the event.",
        "Community startups and student teams often showcase their work during Tech Week.",
        "Tech Week is a great chance to meet tech alumni, local entrepreneurs, and UIS staff.",
        "There's a design thinking workshop, innovation labs, and entrepreneurship sessions during UCU Tech Week.",
        "Students interested in app development get to present their ideas and get mentorship.",
        "Tech Week includes interactive Q&A sessions with UIS leadership.",
        "Cybersecurity certification classes run during UCU Tech Week for interested students.",
        "There are cloud-security and safe internet-use seminars in Tech Week.",
        "At the end of UCU Technology Week, there is a demo day for student projects.",
        "Tech Week occurs once every major semester — keep an eye on UIS announcements.",
        "First-year students can benefit greatly from the basic Alpha and portal sessions.",
        "Alumni mentors often lead sessions on entrepreneurship during UCU Tech Week.",
        "There are IoT and robotics showcases sometimes during UCU Tech Week.",
        "Workshops on cloud infrastructure, networking, and software dev are common in Tech Week.",
        "Many students attend Tech Week to improve their digital literacy and build their resumes.",
        "You can register for specific Tech Week sessions via a form shared by UIS.",
        "UIS provides support throughout the week — including device diagnostics, software help.",
        "Digital security and phishing awareness are emphasized during UCU Tech Week.",
        "Design thinking and startup creation are encouraged via innovation labs during Tech Week.",
        "There are mentorship opportunities for students to pitch ideas to entrepreneurs.",
        "You can get certificate of participation for Tech Week workshops at UCU.",
        "Tech Week is open to all UCU students — not just those in computer science.",
        "UIS coordinates with faculties so that some events are faculty-specific during the week."
      ]
    },
    {
      "tag": "emergency_contacts",
      "patterns": [
        "What is the UCU security toll-free number",
        "UCU emergency contact for campus security",
        "Who to call for medical emergency at UCU",
        "UCU counselling emergency phone number",
        "What is the UCU health centre emergency line",
        "How to reach Allan Galpin Health Centre in an emergency",
        "Who to call for UCU fire emergency",
        "What is the number for UCU night security escort",
        "How to report theft on UCU campus",
        "Lost ID — who to call at UCU",
        "What number is for UCU police or security post",
        "How to contact UCU security from my phone",
        "Emergency number for UCU Kampala Campus",
        "UCU counseling line number",
        "Security number if I feel unsafe at UCU at night",
        "UCU phone for health centre during after hours",
        "Who to call if a student collapses in class at UCU",
        "How to get medical help on UCU campus immediately",
        "What is the UCU emergency line for students in crisis",
        "Can I call UCU security for escort to my residence hall",
        "What is UCU's free line for mental health emergencies",
        "UCU's urgent health centre number",
        "Who to call for student medical help on UCU campus",
        "UCU's campus emergency phone number",
        "How do I contact UCU's security gatehouse in an emergency",
        "UCU's 24-hour security contact",
        "UCU phone to call if there is a security incident at night",
        "How to reach UCU counseling centre if I feel depressed",
        "What is UCU's crisis helpline number",
        "Who to call for first aid on UCU campus",
        "UCU number for ambulance / campus medical team",
        "How to report a fire or disaster at UCU",
        "Who handles emergencies at UCU during weekends",
        "What to do in case of accident at UCU campus",
        "UCU emergency helpline for students",
        "How to reach UCU's out-patient clinic in an emergency",
        "UCU security phone for trespassing or theft",
        "What is UCU's on-campus police or security post number",
        "How to call UCU security from my Ugandan mobile",
        "UCU counseling welness crises phone",
        "Where to find UCU's emergency contacts list",
        "Does UCU have a 24/7 medical emergency number",
        "How do I contact UCU Health Centre after hours",
        "UCU's security and medical emergency hotline",
        "What to do if there is a serious incident on UCU campus",
        "How to reach UCU's night time security for an escort",
        "Who to call at UCU if a friend is sick late at night",
        "UCU's lost-ID emergency reporting number",
        "Emegency telephone for UCU's student services",
        "UCU security number – call before midnight",
        "How to report a medical emergency in the Nkoyoyo Hall area",
        "UCU psychiatric or mental health emergency line",
        "What is UCU's emergency response for campus accidents",
        "How to contact UCU campus operations in a crisis",
        "Who to call if there is a fire in UCU's lecture block",
        "UCU number for security help when walking across campus",
        "How to report suspicious activity at UCU campus",
        "UCU's phone for campus ambulance or first-aid team",
        "Who to call in case of student injury on UCU campus",
        "What is the direct line to UCU's Health Centre"
      ],
      "responses": [
        "UCU Security (toll-free): 0800-200-140.",
        "Allan Galpin Health Centre emergency number: 0800-200-141.",
        "UCU's 24/7 counselling emergency line: 0800-202-800.",
        "In case of a fire or security incident on campus, call UCU Security immediately.",
        "Lost ID? Report it to UCU Security using the emergency number.",
        "If someone is hurt or needs medical help on campus, call the UCU Health Centre line.",
        "For mental health crises, you can use the UCU counselling emergency number.",
        "Night-time security escort available — reach out via the UCU emergency security line.",
        "To report theft or suspicious behaviour, call UCU Security's emergency hotline.",
        "Emergency contact numbers are posted on UCU campus noticeboards and student portal.",
        "If you feel unsafe while walking across UCU campus at night, call security for an escort.",
        "UCU's medical emergency helpline should be your first call in case of accident on campus.",
        "You can reach the UCU counseling team during crises using the emergency line.",
        "Use the security line to report incidents that require immediate UCU campus intervention.",
        "For serious medical incidents, dial the health centre emergency line.",
        "If a student is injured in hall, use the UCU emergency number to call for first-aid support.",
        "Campus crisis response at UCU is coordinated via the security and health emergency numbers.",
        "UCU's emergency contacts are accessible on the university website and campus directory.",
        "The security gatehouse is reachable via the emergency line for rapid response.",
        "Please save UCU's emergency numbers — security, health centre, and counseling — in your phone."
      ]
    },
    {
      "tag": "sports",
      "patterns": [
        "What sports does UCU offer",
        "Which sports team can I join at UCU",
        "Does UCU have a football team",
        "How to try out for UCU rugby team",
        "Is there a basketball team at UCU",
        "How to join netball at UCU",
        "Does UCU have a volleyball club",
        "Where is the UCU athletics field",
        "Can I train at UCU gym as a student",
        "Does UCU have a woodball team",
        "Are there tennis courts at UCU campus",
        "What is the location of the UCU sports ground",
        "Does UCU compete in inter-university sports",
        "How to join UCU's chess team",
        "Is there swimming at UCU",
        "How good is UCU in national athletics competitions",
        "When are UCU sports trials held",
        "How to register for UCU sports teams",
        "Who is the sports tutor at UCU",
        "Does UCU offer sports scholarships",
        "Does UCU have a fitness center",
        "Where is the UCU gym located",
        "Can non-athlete students train at UCU sports complex",
        "What are the top UCU sports teams",
        "Does UCU have an established soccer (football) team",
        "How to become part of UCU basketball squad",
        "Is track and field available at UCU",
        "How to contact UCU sports department",
        "Which sports are most popular at UCU",
        "Does UCU have competitive volleyball teams",
        "Are UCU's sports facilities free for students",
        "Can students bring friends to UCU sports complex",
        "What equipment is available in the UCU gym",
        "Does UCU have a tennis club for beginners",
        "Is there a UCU women's netball team",
        "How to train for UCU athletics team",
        "Which building is the UCU sports office near",
        "How to find the UCU sports schedule for training",
        "Are there student-led sports clubs at UCU",
        "Does UCU have a football league among halls",
        "What sport facilities are in UCU Sports Complex",
        "Where is the UCU athletics track",
        "How to reserve the sports fields for student events",
        "Does UCU run fitness classes",
        "Can I join UCU's badminton club",
        "Does UCU have a rugby ladies' team",
        "What inter-hall sports does UCU host",
        "Is there an annual UCU sports gala",
        "How to apply for a sports scholarship at UCU",
        "How to access UCU sports complex for training",
        "Does UCU have coaches for student athletes",
        "What sports are available in UCU's intramural program",
        "Can final-year students join UCU sports teams",
        "Is there a fee for using UCU sports facilities",
        "Does UCU host inter-university sports tournaments",
        "Can students shadow UCU athletes during training",
        "How to become a UCU varsity athlete",
        "Are there weekend sports clinics at UCU",
        "Does UCU have a basketball court on campus",
        "How big is the UCU sports gym",
        "Does UCU have a swimming pool or water facility",
        "Where can I see UCU's sports team roster",
        "What terms do UCU sports competitions happen in",
        "What role does sports department play in UCU student life",
        "Are there student-athlete scholarships at UCU",
        "How to join UCU's woodball tournaments",
        "Which sports facility is closest to Nkoyoyo Hall",
        "How to reach the gym from the academic blocks at UCU",
        "What are UCU's most successful sports teams",
        "How to train for football in UCU as a beginner",
        "Does UCU organize sports events for first years",
        "What is the process to propose a sports club at UCU",
        "Does UCU have a track team for competitive running",
        "Where is the basketball court on UCU campus",
        "How to contact UCU's athletic director",
        "Is there a sports complex open every day at UCU",
        "How to join UCU's inter-hall sports competitions",
        "Does UCU host community sports days",
        "What sports gear does the UCU sports department provide",
        "How are UCU sports teams selected each semester"
      ],
      "responses": [
        "UCU offers many sports including football, rugby, basketball, volleyball, athletics, woodball, and tennis.",
        "The UCU Sports Complex has a modern gym where students train for athletics and team sports.",
        "You can try out for the rugby team during trial periods announced by the Sports Department.",
        "UCU's basketball team regularly competes in inter-university tournaments.",
        "If you want to join netball or volleyball, contact the Sports Tutor for tryout dates.",
        "There is a woodball club at UCU — many students play on the Sports Complex grounds.",
        "Tennis courts are available on campus and students can join the UCU tennis club.",
        "Athletics training happens at the UCU Sports Complex; the athletics outfit is well recognized.",
        "Student athletes can apply for sports scholarships based on talent and performance.",
        "To register, speak with the Sports Department at UCU or check notices on the student portal.",
        "The Sports Tutor oversees team selection, training, and inter-university participation.",
        "Fitness classes and gym training are offered in the Sports Complex for students.",
        "UCU organizes inter-hall sports competitions every semester.",
        "Many UCU athletes represent the university in national competitions in athletics, rugby, etc.",
        "Weekend clinics for sports like basketball and rugby are run by UCU's sports office.",
        "Students can book the Sports Complex fields for practice and informal games.",
        "Coaches are available for varsity-level sports teams at UCU.",
        "Intramural sports are supported by UCU for students who want to play recreationally.",
        "Tryouts for new sports teams are usually announced at the start of each semester.",
        "There are sports leadership positions within student clubs that you can apply for.",
        "The Sports Complex opens to students daily (check student portal for exact hours).",
        "The gym is accessible to both athletes and non-athletes for regular fitness.",
        "Contact the Athletic Director to learn how to join UCU's varsity teams.",
        "The Sports Department sometimes offers gear or kits for registered team members.",
        "UCU's inter-university athletics team is well known and competes in regional competitions.",
        "Student coaches lead some sports training sessions for new members.",
        "If you are interested in a sports scholarship, check with the sports office for the criteria.",
        "Team rosters are published on the UCU sports noticeboard and the student portal.",
        "Tryouts for sports like volleyball and netball are open to all students, not just athletes.",
        "The gym is located inside the Sports Complex — just beside the athletics tracks.",
        "Sports events like inter-hall tournaments are organized by student guild or sports office.",
        "UCU's sports teams practice every evening at the Sports Complex grounds.",
        "You can join the woodball training group via the Sports Department or student guild.",
        "UCU also organizes community-wide sports days where students, staff, and alumni compete.",
        "The sports grounds are easy to access and are well maintained by the university.",
        "Athletics team training happens under experienced coaches at the Sports Complex.",
        "To join a UCU sports club, start by contacting the Sports Office or student-athlete coordinator.",
        "Team selection for varsity sports is based on trials, fitness, and performance.",
        "Students are encouraged to participate in sports as part of UCU's holistic education approach.",
        "You can view UCU sports schedules on the student portal or via the sports office."
      ]
    },
    {
      "tag": "student_portal_and_it",
      "patterns": [
        "How do I contact UCU UIS helpdesk",
        "What is the phone number for UCU ICT support",
        "Helpdesk email for UCU University ICT Services",
        "Where is the UIS office located on UCU campus",
        "How can I reset my Alpha MIS password",
        "My student portal password is not working — UCU help",
        "How to log in to the UCU student portal",
        "How to connect to Wi-Fi on UCU campus",
        "What is the eduroam configuration for UCU students",
        "How to access my UCU Moodle account",
        "Moodle login issues at UCU",
        "Is there free Microsoft Office for UCU students",
        "How to set up my student email at UCU",
        "Where can I download Microsoft 365 with my UCU student credentials",
        "How to report a problem with Alpha on UCU portal",
        "Does UCU have cloud storage for students",
        "Where to report broken computers in the UCU labs",
        "How to request a new computer account at UCU",
        "When is UIS open for walk-in support",
        "How to submit a ticket to UCU ICT Services",
        "Can I get technical support during UCU Tech Week",
        "Where is the UCU Wi-Fi router for student halls",
        "How to connect to the student Wi-Fi network in UCU hostels",
        "How to use the UCU OneDrive with my student account",
        "How to backup files via UCU's cloud services",
        "How to change my UCU student email password",
        "How to update my profile in the UCU portal",
        "How to view my UCU fee statement in Alpha",
        "How to check my UCU exam card on the portal",
        "How to download course results on UCU Alpha",
        "How to submit assignments on Moodle at UCU",
        "Why is the UCU portal not loading for me",
        "How to fix \"Alpha down\" error UCU",
        "Where to report phishing emails using UCU student email",
        "How to use UCU's virtual desktop (if any)",
        "What services UIS provides to UCU students",
        "How to connect my phone to UCU's campus network",
        "How to access UCU's password recovery system",
        "Does UCU provide training on how to use campus ICT systems",
        "Where is the UIS training room on campus",
        "How to request software from UCU ICT Services",
        "Where is the UCU ICT directorate located",
        "How to make an appointment with UIS for technical help",
        "Can I join internship programs with UIS as a UCU student",
        "How to register for UCU cloud training sessions",
        "How to report network downtime at UCU",
        "How to enroll in UCU's digital literacy programs",
        "How to reset my Moodle password via UIS",
        "My OneDrive is not syncing — how to fix with UCU help",
        "How to access virtual labs offered by UCU UIS",
        "How to configure email on my phone with UCU email settings",
        "What is the student mail domain for UCU",
        "How to use UIS for class registration help",
        "How to find UIS tutorials on the student portal",
        "Does UCU have a WhatsApp support line for ICT issues",
        "How to access campus Wi-Fi when I move between blocks",
        "How to check my Alpha account status at UCU",
        "Where to pay for ICT-related fines or lost student card for network access",
        "How to request a network cable in halls as a UCU student",
        "How to connect to UCU's eduroam when on campus",
        "How to get help when Moodle is not working during exams",
        "How to find the UIS director's office at UCU",
        "What time does the ICT help desk close at UCU",
        "How to report a student email hack at UCU",
        "How to reset my university credentials when I graduate",
        "How to access UCU's student portal from my phone",
        "Is there a UIS mobile app for UCU students",
        "How to get access to UCU's IT services for research",
        "How to request a new Wi-Fi password for my UCU hall room",
        "How to schedule an appointment with UCU's ICT team",
        "How to join UIS-led digital workshops at UCU",
        "How to request UIS technical documentation",
        "How to report broken printers in UCU labs",
        "How to set up my student workspace with UCU cloud tools",
        "How to get remote support from UCU UIS",
        "Does UCU UIS provide laptop screening services",
        "How to log a self-service ticket to UCU ICT",
        "How to get help for virtual learning platforms (e.g. Moodle) at UCU",
        "How to enable two-factor authentication for UCU email",
        "Where to find user guides for Alpha and Moodle on the portal"
      ],
      "responses": [
        "You can reach UCU's ICT helpdesk at +256 312 350816.",
        "For technical support, email UIS at helpdesk@ucu.ac.ug.",
        "The UIS office is located in the library — check at room 308 when you visit.",
        "To reset your Alpha MIS password, use the 'Forgot Password' link or contact UIS support.",
        "Moodle login issues can be reported to UIS; they provide support for learning platform problems.",
        "UCU supports eduroam for Wi-Fi; configure your device using your student credentials.",
        "Yes — you can get free Microsoft 365 (Word, Teams, OneDrive) via your UCU email.",
        "To submit a ticket to UIS, go to the helpdesk portal or email them directly.",
        "You can backup your documents to UCU cloud storage via UIS cloud services.",
        "If the portal is down or locked, contact UIS as it may be a technical or account issue.",
        "The student portal (Alpha) shows your tuition statement, exam card, and results.",
        "You can backup your study notes in your UCU OneDrive linked to your student account.",
        "For network issues in halls, report to UIS via their helpdesk or visit their office on campus.",
        "To connect to Wi-Fi in halls, use the eduroam SSID and configure using your UCU login.",
        "You can enroll in UIS-led digital literacy workshops to learn more about UCU systems.",
        "If Moodle is not working during exams, call UIS immediately for priority support.",
        "Users can request software installations (approved by UIS) for academic needs.",
        "You can configure your UCU email on mobile; use IMAP/Exchange settings provided by UIS.",
        "To schedule a meeting with UIS technicians, use their helpdesk portal or walk in at the ICT center.",
        "UIS supports research students with cloud workspace, remote desktops, and storage.",
        "If you lose network access in your room, ask UIS to check your network cable or Wi-Fi settings.",
        "All UCU students can submit a self-service ticket for ICT issues; it's tracked to resolution by UIS.",
        "Yes — you can join internship programs with UIS if you're interested in IT careers.",
        "UIS offers device diagnostics and checkups during UCU Tech Week.",
        "You can access UIS user-guides for Alpha and Moodle on the student portal under 'Support'.",
        "If you graduate, you may request to keep access to your student email temporarily — check with UIS.",
        "Two-factor authentication for your UCU email can be set up via UIS for security.",
        "There are walk-in hours for technical help at the UIS office, especially during busy periods.",
        "You can report broken printers in labs to UIS; they coordinate repairs and toner refills.",
        "To join UIS training sessions, check the 'Events' section on the student portal.",
        "UIS provides both remote and on-campus support for students — use the helpdesk for either.",
        "Request to borrow a laptop from UIS if you don't have one for your coursework.",
        "When your student portal is locked, UIS will help restore access after verification.",
        "There is a user manual for Alpha MIS and Moodle — ask UIS for a copy or link.",
        "UIS also handles student digital identity, so they can help secure your login credentials.",
        "If you move rooms or halls, UIS can help you reconfigure your Wi-Fi or network setup.",
        "To report cybersafety issues (phishing etc.), contact UIS immediately.",
        "UIS helps students set up their cloud workspace for coursework and storing documents.",
        "If you're new, UIS often runs induction sessions to teach how to use Alpha, Moodle, and email.",
        "You can get help from UIS for remote access to university systems even off campus."
      ]
    },
    {
  "tag": "student_portal_login",
  "patterns": [
    "How do I login to Alpha portal",
    "Alpha portal username",
    "Forgot Alpha password",
    "Moodle login help",
    "Student portal not loading",
    "Wi-Fi login UCU",
    "Change password Alpha",
    "Reset student email password",
    "Access OneDrive UCU",
    "Download Microsoft Office for free",
    "Portal showing fees due",
    "Alpha down today",
    "Portal registration locked",
    "Check my exam results on portal",
    "Submit assignments Moodle",
    "Moodle issues",
    "Alpha tutorial",
    "ICT helpdesk location",
    "Student email configuration",
    "Student portal features",
    "Alpha mobile app",
    "How to check my fees statement",
    "Portal 2FA issues",
    "Connect to eduroam Wi-Fi",
    "Change Moodle profile picture",
    "Retrieve forgotten username",
    "Student account locked",
    "Get portal support",
    "Student email not receiving mails",
    "Office 365 free download",
    "Login problem Alpha portal",
    "Alpha portal password expired",
    "Moodle course upload",
    "Access student timetable",
    "Portal slow today",
    "Alpha portal security questions",
    "Wi-Fi password change",
    "Login Alpha portal on mobile",
    "Moodle notifications missing",
    "Student portal FAQ",
    "Check my CU registration",
    "Alpha portal tutorial video",
    "Student IT services UCU",
    "Alpha portal helpdesk",
    "Moodle grades not showing",
    "Activate student email",
    "Student portal maintenance schedule",
    "Check library e-resources login",
    "Alpha portal features",
    "Password reset link not working",
    "Access portal from abroad",
    "Update profile on portal"
  ],
  "responses": [
    "Alpha portal: https://myucu.ucu.ac.ug — username is your registration number.",
    "Reset your Alpha password via 'Forgot Password' link sent to your student email.",
    "Student email: firstname.lastname@students.ucu.ac.ug — includes free Microsoft 365.",
    "Moodle/eLearning: https://elearning.ucu.ac.ug — same credentials as Alpha portal.",
    "ICT Helpdesk is in the library basement, weekdays 8 AM–5 PM.",
    "Wi-Fi: UCU-Students or eduroam — password updated each semester.",
    "Portal locked usually due to unpaid fees — clear at least 50% to regain access.",
    "All students have free OneDrive, Teams, Word, Excel, PowerPoint.",
    "For persistent issues, email helpdesk@ucu.ac.ug",
    "Check portal maintenance schedules on Alpha announcements.",
    "Activate student email via the ICT portal page.",
    "Student portal FAQ has tutorials for Alpha, Moodle, Wi-Fi, printing.",
    "Download Office 365 free via your student credentials.",
    "Moodle not showing assignments? Contact ICT helpdesk.",
    "Alpha mobile app available for checking results, timetable, and fees.",
    "Reset portal 2FA in case of login issues.",
    "Student email configured on Outlook or Gmail via IMAP.",
    "Forgot username? Use your registration number or contact helpdesk.",
    "Portal slow? Clear cache or try different browser.",
    "Alpha security questions ensure your account remains protected.",
    "Check library e-resources access using student credentials.",
    "Need to submit assignments online? Upload to Moodle.",
    "Check your semester timetable on Alpha portal.",
    "Portal notifications appear only after login — enable email alerts.",
    "Update your profile details on Alpha to keep contact info current.",
    "Portal error messages? Screenshot and contact helpdesk.",
    "Alpha portal works globally — you can access from abroad.",
    "Check CU registration confirmation in your student portal dashboard.",
    "Moodle grades appear within 2–3 weeks after exams.",
    "Alpha portal tutorial videos available on ICT YouTube channel.",
    "Check Alpha announcements for all IT-related updates.",
    "Login problem? Use 'Forgot Password' or contact ICT immediately.",
    "Email helpdesk for persistent access problems.",
    "Student portal provides access to results, fees, timetable, and registration.",
    "Change your Moodle profile picture from the settings tab.",
    "Check exam card and course registration via Alpha portal.",
    "Wi-Fi eduroam configuration available on ICT helpdesk site.",
    "Alpha portal provides access to scholarships, bursaries, and notifications.",
    "Activate OneDrive storage using student email credentials.",
    "Check Moodle course upload deadlines on the portal.",
    "ICT Helpdesk opens weekdays from 8 AM to 5 PM — bring your ID.",
    "Student email allows communication with lecturers and admin.",
    "Use portal to print exam cards and registration confirmation.",
    "Alpha mobile app notifications include exams and fee reminders.",
    "Portal features include course registration, fee statements, and grades.",
    "Check ICT announcements for software updates.",
    "Student portal supports password recovery and account verification.",
    "Contact ICT for Alpha portal or Moodle login issues.",
    "Use your student ID for authentication when accessing Alpha.",
    "Alpha portal supports multiple browsers: Chrome, Edge, Firefox.",
    "Check Moodle for assignment submissions and course materials.",
    "ICT Helpdesk provides support for Wi-Fi, email, portal, and software issues."
  ]
},
{
  "tag": "sports",
  "patterns": [
    "What sports are played at UCU",
    "UCU sports teams",
    "Join rugby team",
    "Basketball team UCU",
    "Volleyball tryouts",
    "Football team UCU",
    "Netball team",
    "Woodball UCU",
    "Athletics team",
    "Swimming at UCU",
    "Tennis club UCU",
    "Table tennis team",
    "Hockey team",
    "Chess club sports",
    "When is sports gala",
    "Inter-hall sports",
    "UCU Mavericks rugby",
    "UCU Cardinals football",
    "Sports scholarships UCU",
    "Gym facilities",
    "Where is the sports ground",
    "Sports day UCU",
    "Sports tutor contact",
    "University league fixtures",
    "How to join a university sports team",
    "Rugby practice schedule",
    "Basketball tryouts time",
    "Football league UCU",
    "Netball practice",
    "Athletics training schedule",
    "Swimming lessons",
    "Tennis practice",
    "Inter-hall football",
    "Gym membership UCU",
    "Sports equipment hire",
    "Sports hall location",
    "Cricket team UCU",
    "Badminton club UCU",
    "Sports event calendar",
    "Track and field events",
    "Fitness centre hours",
    "Sports facilities map",
    "Join volleyball team",
    "UCU sports coaches",
    "Sports competitions UCU",
    "Team registration process",
    "Sports achievements UCU",
    "University rugby league",
    "Women's football team",
    "Men's volleyball team",
    "Basketball training venue",
    "Athletics trial dates",
    "Fitness trainer UCU"
  ],
  "responses": [
    "UCU has strong teams in rugby, basketball, football, netball, volleyball, woodball, athletics, tennis, hockey, table tennis, chess, and swimming.",
    "Men's rugby team (UCU Mavericks) and ladies rugby regularly compete in national competitions.",
    "Football team (UCU Cardinals) plays in the University Football League (UFL).",
    "Netball and volleyball teams often win inter-university competitions.",
    "Woodball is a national university champion sport at UCU.",
    "Join any team by attending trials announced at the start of each semester.",
    "Contact Sports Tutor Mr. David Katono or team captains for trials.",
    "Inter-hall competitions held every semester contribute to Hall Championship trophy.",
    "Sports ground located behind Faculty of Engineering & Technology Park.",
    "Gym/fitness centre at Sports Complex is open to all students with valid ID.",
    "Sports scholarships available for talented athletes — apply through Sports Department.",
    "Annual UCU Sports Gala held in Easter semester featuring athletics and fun events.",
    "Follow @UCUSports on Instagram and X for fixtures, results, and trial announcements.",
    "Training schedules posted on noticeboards and via team WhatsApp groups.",
    "All sports teams have coaches from university staff or alumni.",
    "Students can participate in multiple sports with faculty permission.",
    "Swimming pool located near Technology Park; lessons by appointment.",
    "Tennis courts are at the Sports Complex; rackets can be borrowed.",
    "Chess club holds weekly tournaments in Library Conference Room.",
    "Hockey team practices Tuesdays and Thursdays 4–6 PM on main ground.",
    "Table tennis equipment available at Sports Complex.",
    "Fitness centre includes weights, cardio, and personal trainers.",
    "UCU Mavericks rugby competes in National 7s annually.",
    "UCU Cardinals football has won several UFL titles.",
    "Women's volleyball team trains MWF afternoons.",
    "Track and field athletics participate in national university games.",
    "Gym membership free for all registered students.",
    "Join sports clubs during orientation or via Sports Department.",
    "Sports hall located next to Technology Park building.",
    "Cricket team participates in Uganda University Cricket Association leagues.",
    "Badminton club meets weekly at Sports Complex.",
    "Check Sports Department noticeboard for competitions and registration.",
    "Sports achievements displayed on the Sports Office noticeboard.",
    "University rugby league includes Mavericks and other Ugandan university teams.",
    "Men's volleyball team participates in inter-university championships.",
    "Basketball training held in Main Sports Hall.",
    "Athletics trial dates announced at semester start.",
    "Fitness trainers available Monday–Friday in gym.",
    "Students can request sports equipment via Sports Office.",
    "UCU organizes inter-hall competitions in football, basketball, volleyball, and athletics.",
    "Sports calendar available on student portal.",
    "Hall teams contribute points to overall Hall Championship trophy.",
    "Swimming lessons free for beginners; advanced lessons by coach appointment.",
    "Tennis club open to beginners and experienced students.",
    "Sports day involves athletics, tug-of-war, sack races, and team games.",
    "All sports equipment maintained by Sports Department.",
    "Join women's football team via trial sign-up sheet at Sports Office.",
    "Men's rugby and football trials announced every semester start.",
    "All inter-university sports follow Uganda University Sports Association rules.",
    "Students with outstanding achievements may get sports scholarships.",
    "Follow official social media for trial announcements and results."
  ]
},
{
  "tag": "clubs_and_societies",
  "patterns": [
    "Clubs at UCU",
    "How to join a club",
    "Student societies UCU",
    "AICU club",
    "GDSC UCU",
    "Rotaract UCU",
    "Debate Union",
    "Drama club",
    "Worship team",
    "Engineering Society",
    "Law Society UCU",
    "Scripture Union",
    "Red Cross UCU",
    "University Choir",
    "Photography club",
    "Business Club",
    "Start new club",
    "Club recruitment",
    "Faculty clubs",
    "Christian unions UCU",
    "Orientation week clubs",
    "Guild noticeboard clubs",
    "Clubs meeting schedule",
    "Drama auditions",
    "Choir auditions",
    "Tech club recruitment",
    "Science club activities",
    "Rotaract community projects",
    "Debate competition UCU",
    "Music club registration",
    "Photography exhibitions",
    "Leadership workshops",
    "Guild club registration",
    "Clubs budget approval",
    "New club proposal",
    "Club events calendar",
    "Christian Union activities",
    "Engineering projects club",
    "Law society seminars",
    "Club email lists",
    "Sports club registration",
    "Chess club UCU",
    "Book club activities",
    "Social entrepreneurship club",
    "Entrepreneurship events",
    "Student government clubs",
    "Guild mentorship programs",
    "Community service clubs",
    "Alumni club involvement",
    "Volunteer opportunities clubs",
    "Student club leadership roles"
  ],
  "responses": [
    "UCU has over 40 registered clubs including AICU, GDSC, Rotaract, Debate Union, Law Society, Engineering Society, Scripture Union, Choir, Drama Society, and more.",
    "Major recruitment occurs during Orientation Week and first two weeks of semester.",
    "Check Guild noticeboard next to the canteen for weekly club activities.",
    "To start a new club: minimum 20 members, constitution, Dean of Students approval.",
    "AICU is very active for IT and Computing students.",
    "Rotaract and Red Cross organise many community service projects.",
    "Debate Union and Drama Society (UCU Players) are award-winning.",
    "Worship team and Choir auditions held at the beginning of each semester.",
    "Faculty-based clubs meet regularly in their buildings.",
    "All clubs must register with the Dean of Students office.",
    "Photography club holds exhibitions on campus annually.",
    "Business Club hosts entrepreneurship and leadership workshops.",
    "Drama auditions posted on Guild noticeboards.",
    "Music club rehearsals every Wednesday 4–6 PM.",
    "GDSC runs coding and tech workshops for students.",
    "Science Club organises monthly lab demonstrations.",
    "Rotaract conducts blood drives and community cleanup projects.",
    "Debate competitions announced via Guild communications.",
    "Social entrepreneurship club helps students start small ventures.",
    "Christian Union conducts weekly Bible study and fellowship.",
    "Law Society organises seminars and moot court competitions.",
    "Engineering Society hosts tech talks and hackathons.",
    "Student government clubs provide leadership training.",
    "Volunteer opportunities are announced by Guild and Rotaract.",
    "Guild mentorship programs connect seniors with freshmen.",
    "Alumni occasionally join club activities as mentors.",
    "Clubs may apply for university funding each semester.",
    "Book club meets in the library seminar room every Friday.",
    "Chess club holds tournaments monthly in the Student Centre.",
    "Entrepreneurship club participates in UCU Buzzer and markets.",
    "Orientation week includes club exhibition stalls.",
    "New club proposal forms available at Dean of Students office.",
    "Photography club provides equipment on loan for members.",
    "Guild approves club events after submitting schedule.",
    "All club meetings and events listed on Guild portal.",
    "Clubs maintain email lists for announcements.",
    "Students can join multiple clubs simultaneously.",
    "Clubs compete in inter-university competitions annually.",
    "Clubs organise community service trips during recess term.",
    "Leadership workshops open to all club members.",
    "Clubs submit annual reports to Dean of Students.",
    "Club activities often include competitions and prizes.",
    "New member orientation sessions organised by each club.",
    "Guild posts deadlines for club registrations each semester.",
    "Student life is enriched through participation in multiple clubs.",
    "Clubs may collaborate on large events like Tech Week or Cultural Gala.",
    "All club leaders must maintain good disciplinary record.",
    "Guild supervises and mentors club executives.",
    "Clubs can request university venues for events.",
    "Each club has faculty or staff advisor for guidance.",
    "Student clubs foster skills in leadership, teamwork, and innovation."
  ]
},
{
  "tag": "mental_health",
  "patterns": [
    "Mental health services UCU",
    "Counselling at UCU",
    "Stress management tips",
    "Depression support",
    "Anxiety help",
    "Counsellor contact",
    "Wellness centre",
    "Therapy sessions UCU",
    "Student wellbeing",
    "Emotional support",
    "Coping with stress",
    "Mindfulness workshops",
    "Mental health club",
    "Counselling appointment",
    "UCU wellness programs",
    "Peer support groups",
    "Confidential counselling",
    "Stress relief activities",
    "Mindfulness meditation",
    "Relaxation exercises",
    "Student therapy sessions",
    "Talk to a counsellor",
    "Campus health centre",
    "Mental health hotline",
    "Crisis support UCU",
    "Wellness tips for students",
    "Emotional health resources",
    "How to manage anxiety",
    "Depression resources",
    "Stress counselling",
    "Campus psychologist",
    "Mental health awareness week",
    "Peer counselling",
    "Confidential therapy",
    "Stress workshops",
    "Anxiety support group",
    "Mental wellbeing sessions",
    "Counselling services hours",
    "Student health services",
    "Mental health support UCU",
    "Psychological counselling",
    "Health and wellness advice",
    "UCU counsellor email",
    "Counselling helpline",
    "Student life mental health",
    "Counselling for exams stress",
    "Self-care tips for students",
    "Therapy room UCU",
    "Mindfulness exercises",
    "Stress relief techniques",
    "Campus health tips",
    "Emotional wellbeing workshops",
    "Depression support group"
  ],
  "responses": [
    "UCU provides counselling and psychological services through the Wellness Centre.",
    "Students can book appointments with registered counsellors via Student Portal.",
    "Services are confidential and free for all registered students.",
    "Workshops on stress management, mindfulness, and emotional wellbeing are held each semester.",
    "Peer support groups help students cope with anxiety and depression.",
    "Counsellors offer individual therapy sessions for personal or academic stress.",
    "Mindfulness and relaxation exercises available in Wellness Centre.",
    "Crisis support is available via the campus hotline during working hours.",
    "Counselling office located near the Main Library, Room 101.",
    "Students are encouraged to practice self-care and time management to reduce stress.",
    "Mental Health Awareness Week promotes seminars, yoga, and wellness talks.",
    "Students with depression or anxiety can request therapy via the online booking form.",
    "Workshops on coping with exam stress and balancing studies are available.",
    "Counsellors provide guidance on emotional, social, and academic challenges.",
    "Campus psychologist consults with students on mental health concerns.",
    "UCU wellness programs include meditation, yoga, and recreational activities.",
    "Students may contact counsellors via email or phone for quick support.",
    "Confidentiality is guaranteed for all counselling sessions.",
    "Peer counselling is available through trained senior students.",
    "Stress relief techniques taught include breathing exercises and journaling.",
    "Emotional wellbeing resources are available in the Health and Wellness section of Student Portal.",
    "Students are advised to seek help early for mental health issues.",
    "Wellness Centre organizes workshops in collaboration with student clubs.",
    "Counsellors can refer students to external specialists if needed.",
    "Counselling sessions can be individual or group-based.",
    "Anxiety and depression support groups meet weekly.",
    "Therapy rooms are private and accessible to all students.",
    "Students are encouraged to maintain a healthy lifestyle for better mental health.",
    "UCU offers online resources on coping with stress and anxiety.",
    "Regular wellness tips are shared via student emails and noticeboards.",
    "Mindfulness meditation sessions held every Friday morning.",
    "Students facing crises outside office hours can use emergency contacts.",
    "Stress management seminars often feature guest speakers and professionals.",
    "Self-care workshops include exercise, nutrition, and mindfulness advice.",
    "Counselling services are open Monday–Friday 8 AM–5 PM.",
    "Students can request follow-up sessions as needed.",
    "Workshops and therapy sessions are free of charge for all students.",
    "Campus counsellors also assist with career-related stress.",
    "Students experiencing mental health challenges are supported without judgment.",
    "Wellness Centre collaborates with clubs for recreational activities.",
    "Counselling sessions are scheduled by appointment to ensure privacy.",
    "Emotional health resources include pamphlets, videos, and online guides.",
    "Peer support sessions promote a safe space for discussion.",
    "Stress relief workshops may include art therapy and mindfulness games.",
    "UCU encourages all students to participate in wellness activities.",
    "Mental health topics are also included in student orientation programs.",
    "Counselling can be requested anonymously via the Student Portal.",
    "Students with exam anxiety can receive targeted workshops.",
    "Wellness Centre also offers guidance on sleep, diet, and lifestyle choices."
  ]
},
{
  "tag": "admissions",
  "patterns": [
    "UCU admission requirements",
    "Apply to UCU",
    "How to apply for UCU",
    "Admission forms UCU",
    "Undergraduate application",
    "Graduate admission",
    "Postgraduate programs",
    "Application deadline",
    "Entry requirements",
    "Fees for admission",
    "Admission status",
    "Check application",
    "Admission portal",
    "UCU acceptance letters",
    "Scholarship application",
    "Application forms download",
    "International students apply",
    "Freshers admission",
    "Continuing students admission",
    "Admission checklist",
    "Admission guidelines",
    "Required documents",
    "UCU application fee",
    "How to pay application fee",
    "Admission letter download",
    "Orientation after admission",
    "Admission interview",
    "Interview tips",
    "Apply online",
    "Application tips",
    "Application submission",
    "UG courses admission",
    "PG courses admission",
    "Application portal login",
    "Admission process timeline",
    "Eligibility for admission",
    "Faculty admission requirements",
    "Apply for direct entry",
    "Application help",
    "Admission FAQs",
    "UCU entry exams",
    "Admission criteria",
    "Admission email contact",
    "UCU acceptance requirements",
    "Apply for Masters",
    "Apply for PhD",
    "Application tracking",
    "Admission confirmation",
    "Admission counseling",
    "Application assistance",
    "Admission documents upload",
    "Admission support email",
    "Application helpdesk"
  ],
  "responses": [
    "UCU offers undergraduate, postgraduate, and diploma programs.",
    "Application forms are available online at the UCU Student Portal.",
    "Admission requirements vary by faculty and program; check Faculty websites for details.",
    "Applicants must submit certified academic transcripts and identification documents.",
    "Application fees can be paid online via mobile money or bank transfer.",
    "International students must provide additional documents including passport and visa.",
    "Direct entry and diploma holders must meet faculty-specific entry requirements.",
    "Admission status can be checked through the Student Portal using application number.",
    "Applicants invited for interviews will be notified via email or SMS.",
    "Orientation for admitted students is held at the start of each semester.",
    "Scholarships are available for high-achieving students; apply during admission.",
    "UG and PG applications are submitted online; hard copies not required.",
    "Admission letters are issued electronically via the Student Portal.",
    "Applicants can contact the Admissions Office for guidance.",
    "Application deadlines are usually in March and September each year.",
    "Faculty-specific entry exams may be required for some programs.",
    "Eligibility criteria include minimum grades, prerequisites, and other requirements.",
    "Admission counseling is provided for first-time applicants.",
    "Supporting documents include certificates, transcripts, ID, and passport photos.",
    "Application tracking is available on the UCU portal.",
    "Applicants should ensure all documents are uploaded correctly.",
    "Freshers must attend orientation to complete registration.",
    "Continuing students follow a separate registration process for new programs.",
    "Admission FAQs provide step-by-step guidance for applicants.",
    "All applications must include a valid email and phone number.",
    "UCU advises applicants to check portal notifications regularly.",
    "Faculty admissions offices handle specific program queries.",
    "Admission confirmation is completed after successful document verification.",
    "Interviews may be conducted online or on-campus.",
    "Applicants must pay the non-refundable application fee to process applications.",
    "PG applicants may need to submit letters of recommendation.",
    "PhD applications require a research proposal and supervisor approval.",
    "Masters applicants must meet undergraduate GPA requirements.",
    "Applicants can request assistance from the Admissions helpdesk.",
    "Application portal supports document uploads in PDF format.",
    "Students may track progress from submission to acceptance on the portal.",
    "Admission support emails respond within 48 hours.",
    "Applicants are advised to read the admission guide carefully before applying.",
    "Late applications may not be considered.",
    "Applicants can join online chat support for help.",
    "Admission interview tips include preparation and familiarity with the program.",
    "Application forms require personal, academic, and contact information.",
    "Applicants should retain a copy of the application confirmation receipt.",
    "International students may need English proficiency certificates.",
    "Direct entry students may need diploma transcripts.",
    "All admitted students must pay initial tuition fees before registration.",
    "Applicants can contact faculty offices for specific program guidance.",
    "Admission assistance is available in person and online.",
    "Application submission is considered complete only after payment confirmation.",
    "UCU provides guidelines on how to fill each section of the application form."
  ]
},
{
  "tag": "exams",
  "patterns": [
    "UCU exam timetable",
    "Exam schedule",
    "Semester exams",
    "Exam dates",
    "Midterm schedule",
    "Final exams UCU",
    "Exam period",
    "Exam registration",
    "Exam venue",
    "Exam rules",
    "Resit exams",
    "Exam results release",
    "Check results",
    "Exam clash",
    "Exam guidelines",
    "Exam hall ticket",
    "Exam start time",
    "Exam end time",
    "Exam duration",
    "Makeup exams",
    "Supplementary exams",
    "Exam room allocation",
    "Exam seating plan",
    "Exam day instructions",
    "Exam hall rules",
    "Online exam schedule",
    "Exam portal login",
    "Exam conflict",
    "Exam form submission",
    "Exam timetable download",
    "Exam calendar",
    "Exam coordinator contact",
    "Exam queries",
    "Exam registration deadline",
    "Exam policies",
    "Exam instructions",
    "Exam attendance",
    "Exam invigilation",
    "Exam misconduct rules",
    "Exam ID requirement",
    "Exam seating",
    "Exam center info",
    "Exam department schedule",
    "Exam updates",
    "Exam timetable query",
    "Exam notice",
    "Exam hall entrance",
    "Exam rules and regulations",
    "Exam time confirmation",
    "Exam day schedule",
    "Exam session",
    "Exam timetable change",
    "Exam management"
  ],
  "responses": [
    "UCU publishes the exam timetable for each semester on the Student Portal.",
    "Students should check the exam schedule regularly for updates.",
    "Midterm and final exams are scheduled according to faculty guidelines.",
    "Exam registration is required before the deadline specified on the portal.",
    "Exam venues are allocated based on the course and department.",
    "Students must bring valid student ID to enter exam halls.",
    "Exam duration and start times are clearly indicated in the timetable.",
    "Makeup or supplementary exams are scheduled after the main exams.",
    "Exam hall tickets can be downloaded from the Student Portal.",
    "Resit exams are only for students who failed or missed main exams.",
    "Exam results are released on the portal after grading is complete.",
    "Students should report any timetable clashes to the Exam Office immediately.",
    "Exam guidelines include prohibited items, conduct rules, and ID requirements.",
    "Online exams require access to the exam portal and reliable internet.",
    "Invigilators monitor exams to ensure compliance with rules.",
    "Exam seating plans are posted in advance in designated halls.",
    "Students must attend all registered exams unless formally excused.",
    "Exam misconduct includes cheating, impersonation, and unauthorized material use.",
    "Students should arrive at least 30 minutes before the exam start time.",
    "Exam hall rules include silence, no electronic devices, and ID verification.",
    "Supplementary exams require approval from the faculty board.",
    "Exam coordinators are available for queries related to scheduling.",
    "Exam notices are posted on departmental noticeboards and portal.",
    "Students must submit exam forms and pay fees before registration closes.",
    "Exam calendar shows all important exam-related dates for the semester.",
    "Exam session times are strictly enforced to ensure fairness.",
    "Exam room allocation is based on course enrollment numbers.",
    "Exam updates are communicated via email and SMS notifications.",
    "Students with disabilities can request special exam arrangements.",
    "Exam day instructions include reporting procedures and emergency contacts.",
    "Exam ID and hall ticket must be presented at all times in the exam hall.",
    "Students are advised to review exam rules before the exam date.",
    "Exam schedule may be changed due to unforeseen circumstances.",
    "Late arrival may result in disqualification from that exam session.",
    "Exam policies are published annually for student reference.",
    "Exam portal login provides timetable, hall ticket, and results.",
    "Exam attendance is mandatory for credit courses.",
    "Exam invigilation ensures integrity and proper conduct.",
    "Students should follow all instructions given by exam supervisors.",
    "Exam seating ensures no student sits next to a friend or classmate.",
    "Exam center info includes building, room number, and facilities.",
    "Exam management team handles scheduling, results, and disputes.",
    "Exam notices are official and supersede any informal communication.",
    "Exam hall entrance requires verification of student ID and ticket.",
    "Exam misconduct may lead to disciplinary action or cancellation.",
    "Students should report any issues to exam invigilators immediately.",
    "Exam time confirmation is posted on the portal before exams start.",
    "Exam session assignments depend on course code and faculty.",
    "Exam timetable changes are announced in advance to all students.",
    "Students must adhere to exam rules to maintain academic integrity."
  ]
},
{
  "tag": "finance_and_fees",
  "patterns": [
    "UCU tuition fees",
    "Pay fees online",
    "Financial clearance",
    "Fee deadlines",
    "Fee structure",
    "Payment plan",
    "Installments",
    "Scholarship and fees",
    "Fee receipt",
    "Bank payment",
    "Tuition payment portal",
    "Fee balance",
    "Student loans",
    "Financial aid",
    "Pay fees in installments",
    "Fee inquiry",
    "Late payment penalty",
    "Bank details for fees",
    "Fee payment confirmation",
    "UCU finance office",
    "Tuition payment methods",
    "Pay fees using mobile money",
    "Fee receipt download",
    "Financial support",
    "Pay course fees",
    "Tuition payment deadline",
    "Fee statement",
    "Fee payment update",
    "Fee portal login",
    "Fee assistance",
    "Student finance queries",
    "Financial account status",
    "Fee verification",
    "UCU finance contacts",
    "Financial clearance process",
    "Pay semester fees",
    "Fee reminders",
    "Tuition installment plan",
    "Student account balance",
    "Fee invoice",
    "Financial services office",
    "Pay for exams",
    "Fee payment confirmation email",
    "Tuition fee guidelines",
    "Fee submission process",
    "Fee payment support",
    "Financial advice for students",
    "Student financial resources",
    "Pay lab fees",
    "Fee dispute",
    "Fee refund process",
    "Finance policies",
    "Financial aid application"
  ],
  "responses": [
    "UCU tuition fees vary by program and are published on the Student Portal.",
    "Students can pay fees online via bank transfer, mobile money, or UCU finance portal.",
    "Financial clearance is required before registration for the next semester.",
    "Fee deadlines are strictly enforced to avoid late payment penalties.",
    "Payment plans and installments may be arranged with the finance office.",
    "Students should obtain a fee receipt after payment for verification.",
    "Scholarships and bursaries can reduce tuition fees; apply early.",
    "Fee balance and account status are available on the Student Portal.",
    "Student loans and financial aid are offered for eligible students.",
    "Late payment may result in registration being blocked for exams or classes.",
    "Finance office provides guidance on fee payment procedures.",
    "All payments should include student ID for proper tracking.",
    "Fee payment confirmation is sent via email after successful transaction.",
    "Students can pay semester or course-specific fees through the portal.",
    "Financial support includes grants, bursaries, and emergency funds.",
    "Fee statements show detailed breakdown of tuition and other charges.",
    "Fee inquiries can be made via email or visit to the finance office.",
    "Financial clearance ensures eligibility to sit exams and register for courses.",
    "Installment plans must be approved by the finance office before deadlines.",
    "Students should keep copies of all fee payment receipts.",
    "Fee portal login provides access to account status and transaction history.",
    "Students can pay lab and practical fees separately if applicable.",
    "Financial aid application requires supporting documents and approval.",
    "Fee refund policies apply in cases of course withdrawal or overpayment.",
    "Finance office handles disputes related to fees and payments.",
    "Payment methods include cash deposit, bank transfer, and mobile money.",
    "Students are encouraged to plan finances to meet all deadlines.",
    "Tuition payment guidelines are published each semester.",
    "Financial resources for students include scholarships, work-study, and loans.",
    "Fee reminders are sent via email and SMS.",
    "Fee invoice includes all applicable charges and deadlines.",
    "Finance policies govern payment, refund, and clearance procedures.",
    "Students may contact finance office for urgent payment issues.",
    "Fee verification ensures payment is correctly recorded in student account.",
    "Financial advice is available to help manage tuition and living costs.",
    "Students must pay fees before registration or accessing results.",
    "Fee payment support is available for technical issues on the portal.",
    "Financial services office is located near Main Administration Block.",
    "Students should reconcile their account after each payment.",
    "Tuition fees differ for international students.",
    "Financial clearance is required to print graduation documents.",
    "Fee payment confirmation email serves as official proof of payment.",
    "Installments should be completed by the specified deadlines.",
    "Fee submission process includes uploading receipts for online payments.",
    "Finance office coordinates with departments for course-specific fees.",
    "Fee disputes must be reported within the semester they occur.",
    "Students should maintain accurate records of all financial transactions.",
    "Financial aid eligibility depends on academic performance and need.",
    "Students can request official fee statements for visa or loan purposes.",
    "Fee portal ensures secure online transactions."
  ]
},
{
  "tag": "emergency",
  "patterns": [
    "Fire emergency",
    "Medical emergency",
    "Accident on campus",
    "Earthquake drill",
    "Evacuation procedures",
    "Campus lockdown",
    "Threat report",
    "Active shooter alert",
    "Natural disaster alert",
    "Chemical spill",
    "Electrical hazard",
    "Flood warning",
    "Severe weather alert",
    "Power outage",
    "Gas leak",
    "First aid assistance",
    "Emergency contact numbers",
    "Ambulance request",
    "Police intervention",
    "Security alert",
    "Suspicious activity",
    "Missing person report",
    "Safety protocols",
    "Emergency response team",
    "Emergency exit locations",
    "Emergency assembly points",
    "Campus safety hotline",
    "Critical incident report",
    "Rescue operations",
    "Crisis management",
    "Fire alarm activation",
    "Medical evacuation",
    "Disaster preparedness",
    "Evacuation route",
    "Emergency drill schedule",
    "Lockdown procedures",
    "Suspicious package report",
    "Campus threat assessment",
    "Emergency broadcast",
    "Hazardous material response",
    "Injury on campus",
    "Emergency evacuation plan",
    "Severe weather protocol",
    "Fire extinguisher location",
    "Campus emergency map",
    "Natural disaster plan",
    "Emergency shelter locations",
    "Crisis hotline",
    "Safety training",
    "Incident reporting",
    "Emergency notifications",
    "Security patrol request",
    "Urgent help request",
    "Critical health incident"
  ],
  "responses": [
    "In case of a fire emergency, immediately activate the nearest fire alarm and evacuate.",
    "For medical emergencies, contact Ambulance at 0800200141 immediately.",
    "Accidents on campus should be reported to Security at 0800200140.",
    "Earthquake drills are conducted periodically to ensure preparedness.",
    "Evacuation procedures are posted throughout campus buildings.",
    "During a campus lockdown, follow instructions from Security or OC UCU Police +256778537233.",
    "Threat reports can be submitted anonymously to campus security.",
    "Active shooter alerts must be taken seriously; follow lockdown protocols.",
    "Natural disaster alerts are broadcasted through the campus notification system.",
    "Chemical spills should be reported immediately and the area evacuated.",
    "Electrical hazards should be reported and avoided until cleared by maintenance.",
    "Flood warnings are issued when water levels pose a risk; follow safety instructions.",
    "Severe weather alerts include storms, high winds, or extreme temperatures.",
    "Power outages are handled by campus facilities; use emergency lights if available.",
    "Gas leaks require immediate evacuation and notification of emergency services.",
    "First aid assistance is available at designated locations across campus.",
    "Emergency contact numbers: Ambulance 0800200141, Security 0800200140, OC UCU Police +256778537233.",
    "Ambulance requests can be made through campus security or directly at 0800200141.",
    "Police intervention is called when safety or law enforcement is needed.",
    "Security alerts notify students of immediate safety concerns on campus.",
    "Suspicious activity should be reported without confrontation.",
    "Missing person reports should be filed immediately with campus security.",
    "Safety protocols are designed to protect students and staff during incidents.",
    "The emergency response team handles critical situations on campus.",
    "Emergency exit locations are marked and should be used during evacuations.",
    "Emergency assembly points are designated safe areas for evacuation.",
    "Campus safety hotlines provide immediate assistance for emergencies.",
    "Critical incident reports document serious events for follow-up.",
    "Rescue operations are conducted by trained emergency personnel.",
    "Crisis management coordinates all emergency responses on campus.",
    "Fire alarm activation alerts everyone to evacuate the building immediately.",
    "Medical evacuation procedures are in place for serious injuries.",
    "Disaster preparedness plans ensure students and staff know what to do.",
    "Evacuation routes are posted in all buildings for safety.",
    "Emergency drill schedules are shared to practice safety measures.",
    "Lockdown procedures instruct students to stay in secure locations.",
    "Suspicious package reports should be made to security without touching the item.",
    "Campus threat assessments help identify and prevent potential risks.",
    "Emergency broadcasts deliver critical information quickly to all areas.",
    "Hazardous material response teams handle spills safely and professionally.",
    "Injuries on campus should be reported and treated immediately.",
    "Emergency evacuation plans are available online and in printed form.",
    "Severe weather protocols ensure safety during storms or extreme events.",
    "Fire extinguisher locations are marked throughout buildings.",
    "Campus emergency maps highlight exits, assembly points, and safety stations.",
    "Natural disaster plans cover earthquakes, floods, storms, and other risks.",
    "Emergency shelter locations provide safe refuge during hazards.",
    "Crisis hotlines offer immediate mental health and safety support.",
    "Safety training sessions teach students how to respond in emergencies.",
    "Incident reporting allows documentation of accidents and hazards.",
    "Emergency notifications are sent via SMS, email, or campus alerts.",
    "Security patrol requests can be made for immediate safety concerns.",
    "Urgent help requests can be communicated to Security or OC UCU Police.",
    "Critical health incidents require immediate medical attention and notification of Ambulance 0800200141."
  ]
},
{
  "tag": "health_and_wellness",
  "patterns": [
    "Medical consultation",
    "Mental health support",
    "Counseling services",
    "Fitness programs",
    "Nutrition advice",
    "Vaccination services",
    "Health checkups",
    "Wellness workshops",
    "Stress management",
    "Yoga sessions",
    "Sports therapy",
    "Rehabilitation services",
    "Emergency medical assistance",
    "Health insurance support",
    "Physical therapy",
    "Health awareness campaigns",
    "Medical appointments",
    "Crisis intervention",
    "Peer counseling",
    "Substance abuse support",
    "Sleep hygiene guidance",
    "Exercise programs",
    "Health screening",
    "Psychological support",
    "Medical records access",
    "Vaccination records",
    "Health risk assessment",
    "First aid training",
    "Student wellness programs",
    "Meditation sessions",
    "Health seminars",
    "Fitness assessments",
    "Nutrition workshops",
    "Counseling appointments",
    "Mental health workshops",
    "Self-care tips",
    "Stress relief activities",
    "Health portal access",
    "Doctor consultations",
    "Therapy sessions",
    "Peer wellness groups",
    "Health education",
    "Medical referrals",
    "Wellness check-ins",
    "Exercise classes",
    "Disease prevention",
    "Vaccination campaigns",
    "Emergency health protocols",
    "Sleep improvement programs",
    "Substance abuse workshops",
    "Student health monitoring",
    "Fitness challenges"
  ],
  "responses": [
    "Medical consultation is available at the campus health center.",
    "Mental health support includes counseling and therapy sessions.",
    "Counseling services provide guidance for personal and academic challenges.",
    "Fitness programs encourage physical well-being and activity.",
    "Nutrition advice is available from certified dietitians and health staff.",
    "Vaccination services are offered periodically for students and staff.",
    "Health checkups help monitor and maintain student health.",
    "Wellness workshops provide strategies for stress and lifestyle management.",
    "Stress management programs teach coping techniques and relaxation.",
    "Yoga sessions improve flexibility, relaxation, and mental focus.",
    "Sports therapy helps prevent and treat injuries from physical activities.",
    "Rehabilitation services assist students recovering from illness or injury.",
    "Emergency medical assistance is available 24/7 on campus.",
    "Health insurance support helps students understand coverage and claims.",
    "Physical therapy improves mobility and physical function.",
    "Health awareness campaigns educate students on preventive measures.",
    "Medical appointments can be scheduled online or at the health center.",
    "Crisis intervention services provide immediate mental health support.",
    "Peer counseling pairs trained students with those seeking support.",
    "Substance abuse support helps students struggling with addiction.",
    "Sleep hygiene guidance promotes healthy sleep habits.",
    "Exercise programs include structured classes and individualized plans.",
    "Health screenings detect potential medical issues early.",
    "Psychological support is available for emotional and mental well-being.",
    "Medical records access allows students to track their health history.",
    "Vaccination records are maintained for compliance and safety.",
    "Health risk assessment evaluates potential health concerns.",
    "First aid training equips students with emergency response skills.",
    "Student wellness programs focus on holistic health and lifestyle.",
    "Meditation sessions enhance mental clarity and stress relief.",
    "Health seminars educate on specific medical and wellness topics.",
    "Fitness assessments evaluate physical condition and goals.",
    "Nutrition workshops provide practical dietary guidance.",
    "Counseling appointments address individual mental health needs.",
    "Mental health workshops teach coping, resilience, and self-care.",
    "Self-care tips promote balanced lifestyle and stress management.",
    "Stress relief activities include mindfulness, sports, and relaxation techniques.",
    "Health portal access provides resources and appointment scheduling.",
    "Doctor consultations address routine and specialized medical needs.",
    "Therapy sessions provide professional mental health support.",
    "Peer wellness groups promote community and shared support.",
    "Health education programs teach prevention and wellness strategies.",
    "Medical referrals connect students to specialized care providers.",
    "Wellness check-ins monitor student health and progress.",
    "Exercise classes improve fitness and overall well-being.",
    "Disease prevention programs educate students on health risks.",
    "Vaccination campaigns ensure protection against infectious diseases.",
    "Emergency health protocols provide guidance during urgent situations.",
    "Sleep improvement programs teach better habits and routines.",
    "Substance abuse workshops provide awareness and recovery resources.",
    "Student health monitoring tracks physical and mental wellness.",
    "Fitness challenges motivate students to stay active and healthy."
  ]
},
{
  "tag": "campus_life",
  "patterns": [
    "Student clubs",
    "Extracurricular activities",
    "Campus events",
    "Orientation programs",
    "Student elections",
    "Cultural festivals",
    "Volunteering opportunities",
    "Workshops and seminars",
    "Networking events",
    "Student government",
    "Sports tournaments",
    "Music and arts programs",
    "Leadership programs",
    "Debate competitions",
    "Club registration",
    "Community service",
    "Talent shows",
    "Student publications",
    "Social events",
    "Career fairs",
    "Club meetings",
    "Campus parties",
    "Student awards",
    "Guest lectures",
    "Film screenings",
    "Student mentorship",
    "Peer support groups",
    "Campus traditions",
    "Orientation week",
    "Team-building activities",
    "Student initiatives",
    "Fundraising events",
    "Open mic events",
    "Student talent showcases",
    "Cultural exchange programs",
    "Innovation competitions",
    "Volunteer drives",
    "Campus newsletter",
    "Student panels",
    "Networking sessions",
    "Leadership workshops",
    "Hackathons",
    "Campus ambassador programs",
    "Student forums",
    "Art exhibitions",
    "Student research presentations",
    "Charity events",
    "Student conferences",
    "Career counseling sessions",
    "Skill-building workshops",
    "Mentorship programs"
  ],
  "responses": [
    "Student clubs provide opportunities for networking and skill development.",
    "Extracurricular activities include sports, arts, and academic clubs.",
    "Campus events are organized throughout the year for student engagement.",
    "Orientation programs help new students acclimate to campus life.",
    "Student elections allow representation in governance and decision-making.",
    "Cultural festivals celebrate diversity and creativity on campus.",
    "Volunteering opportunities encourage community involvement.",
    "Workshops and seminars provide skill-building and professional insights.",
    "Networking events connect students with alumni and industry professionals.",
    "Student government manages student affairs and advocates for peers.",
    "Sports tournaments promote teamwork and healthy competition.",
    "Music and arts programs nurture creativity and performance skills.",
    "Leadership programs develop managerial and organizational skills.",
    "Debate competitions improve communication and critical thinking.",
    "Club registration is open each semester for all students.",
    "Community service initiatives engage students with local needs.",
    "Talent shows showcase students' artistic and performance abilities.",
    "Student publications include newsletters, magazines, and journals.",
    "Social events encourage networking and friendship among students.",
    "Career fairs connect students with potential employers and internships.",
    "Club meetings provide regular collaboration and planning opportunities.",
    "Campus parties allow socialization and stress relief.",
    "Student awards recognize academic, leadership, and extracurricular achievements.",
    "Guest lectures provide exposure to experts and innovators in various fields.",
    "Film screenings foster cultural awareness and entertainment.",
    "Student mentorship pairs experienced students with juniors for guidance.",
    "Peer support groups provide academic and emotional assistance.",
    "Campus traditions maintain the heritage and spirit of the institution.",
    "Orientation week introduces campus resources and student life opportunities.",
    "Team-building activities develop cooperation and leadership skills.",
    "Student initiatives promote social responsibility and innovation.",
    "Fundraising events support student projects and charity activities.",
    "Open mic events encourage expression in music, poetry, and performance.",
    "Student talent showcases highlight achievements in arts, sports, and academics.",
    "Cultural exchange programs allow interaction with international peers.",
    "Innovation competitions stimulate creativity and problem-solving.",
    "Volunteer drives encourage active community participation.",
    "Campus newsletter provides updates and highlights of student life.",
    "Student panels facilitate discussion and sharing of ideas.",
    "Networking sessions foster connections between students and professionals.",
    "Leadership workshops train students in decision-making and organization.",
    "Hackathons promote coding skills and team collaboration.",
    "Campus ambassador programs represent the institution externally.",
    "Student forums allow discussion of campus issues and solutions.",
    "Art exhibitions display student creativity and projects.",
    "Student research presentations share findings with peers and faculty.",
    "Charity events engage students in philanthropic activities.",
    "Student conferences provide academic and professional development opportunities.",
    "Career counseling sessions offer guidance on job search and career planning.",
    "Skill-building workshops enhance technical and soft skills.",
    "Mentorship programs connect students with experienced guides for personal growth."
  ]
},
{
  "tag": "registration_and_enrollment",
  "patterns": [
    "Course registration",
    "Register for semester",
    "Add/drop courses",
    "Registration portal",
    "Enrollment process",
    "Register online",
    "Course enrollment deadline",
    "Change course",
    "Drop course",
    "Add course",
    "Late registration",
    "Registration help",
    "Student registration guide",
    "Registration status",
    "Confirm registration",
    "Registration confirmation",
    "Course selection",
    "Prerequisites for registration",
    "Registration issues",
    "Registration assistance",
    "Enroll in class",
    "Course registration portal",
    "Register for electives",
    "Registration rules",
    "Registration procedure",
    "Course registration deadline",
    "Enrollment verification",
    "Register for labs",
    "Course registration form",
    "Semester registration",
    "Registration support",
    "Check registration",
    "Course enrollment status",
    "Registration instructions",
    "Online enrollment portal",
    "Register new student",
    "Drop/add procedure",
    "Enrollment guide",
    "Course registration update",
    "Registration portal login",
    "Enroll in program",
    "Registration checklist",
    "Confirm enrollment",
    "Register for workshops",
    "Registration FAQs",
    "Registration problem",
    "Register for orientation",
    "Registration contact",
    "Course load limit",
    "Register for minors",
    "Registration window",
    "Registration portal help"
  ],
  "responses": [
    "Students must register for courses each semester through the registration portal.",
    "Add or drop courses before the registration deadline to avoid penalties.",
    "Late registration may incur additional fees and require approval.",
    "Course registration guides are available on the Student Portal.",
    "Prerequisites must be met before enrolling in certain courses.",
    "Students should confirm registration status to ensure enrollment is successful.",
    "Enrollment verification is done by the faculty office.",
    "Online registration requires student login credentials.",
    "Registration confirmation emails are sent after successful course enrollment.",
    "Students can register for electives, labs, and workshops through the portal.",
    "Registration rules include deadlines, course limits, and payment requirements.",
    "Registration support is provided by the academic office.",
    "Students should follow step-by-step instructions for online registration.",
    "Add/drop procedure allows adjustment of course load early in the semester.",
    "Course registration updates are announced on the portal and noticeboards.",
    "Registration portal login requires secure credentials and two-factor authentication.",
    "Students may contact registration office for assistance with issues.",
    "Enrollment guides provide information on course selection and program requirements.",
    "Confirm enrollment before attending classes to avoid scheduling conflicts.",
    "Registration FAQs address common questions about the process.",
    "Students must check registration deadlines for each semester.",
    "Course load limits are enforced to maintain academic standards.",
    "New students must complete initial registration during orientation.",
    "Registration window is open for a limited period each semester.",
    "Students can register for minors or additional programs if eligible.",
    "Registration instructions include step-by-step portal navigation.",
    "Students must ensure prerequisites are satisfied before adding courses.",
    "Registration forms may need submission for manual adjustments.",
    "Enrollment verification ensures student account reflects accurate course registration.",
    "Students may register for special programs with advisor approval.",
    "Registration problem reports should be submitted promptly for resolution.",
    "Students can drop courses within allowed add/drop period without penalty.",
    "Registration portal provides course lists, schedules, and seat availability.",
    "Enroll in workshops or supplemental classes through portal or faculty office.",
    "Confirm registration to avoid issues during exam eligibility checks.",
    "Students are encouraged to register early to secure preferred courses.",
    "Registration support team assists with portal login and technical issues.",
    "Online enrollment portal ensures secure course selection and updates.",
    "Students must follow university deadlines for all course registration activities.",
    "Registration checklist ensures all steps are completed for semester enrollment.",
    "Confirm enrollment to prevent registration errors affecting grades.",
    "Register for orientation sessions as part of new student enrollment.",
    "Course registration forms are sometimes required for manual overrides.",
    "Registration portal help is available for troubleshooting common issues.",
    "Students must keep records of registration confirmations and receipts.",
    "Enrollment in courses without prerequisites may require advisor approval.",
    "Registration contact info is provided for urgent queries.",
    "Semester registration ensures continuity in academic progression.",
    "Students may update course registration before final deadline closure."
  ]
},
{
  "tag": "scholarships_and_aid",
  "patterns": [
    "UCU scholarships",
    "Apply for scholarship",
    "Financial aid application",
    "Bursary information",
    "Scholarship eligibility",
    "Student grants",
    "Merit scholarship",
    "Need-based aid",
    "Scholarship deadline",
    "Apply for bursary",
    "Financial assistance",
    "Scholarship portal",
    "Student funding",
    "Scholarship requirements",
    "Scholarship documents",
    "Award letter",
    "Scholarship disbursement",
    "Apply for financial support",
    "Scholarship FAQs",
    "Scholarship form",
    "External scholarships",
    "Government grants",
    "University bursaries",
    "Scholarship contact",
    "Scholarship announcement",
    "Scholarship updates",
    "Financial aid office",
    "Scholarship status",
    "Scholarship renewal",
    "Apply for fellowship",
    "Grant application",
    "Financial support eligibility",
    "Scholarship approval",
    "Student funding opportunities",
    "Scholarship information session",
    "Scholarship guide",
    "Apply for tuition aid",
    "Scholarship program",
    "Scholarship query",
    "Student financial aid",
    "Scholarship award notice",
    "Scholarship management",
    "Funding assistance",
    "Scholarship portal login",
    "Apply for emergency aid",
    "Scholarship help",
    "Scholarship resources",
    "Scholarship evaluation",
    "Scholarship verification",
    "Apply for international scholarship",
    "Scholarship application process",
    "Scholarship documents submission"
  ],
  "responses": [
    "UCU offers various scholarships and bursaries for eligible students.",
    "Students must meet eligibility criteria before applying for scholarships.",
    "Scholarship deadlines are strictly enforced and published on the portal.",
    "Merit-based scholarships are awarded based on academic performance.",
    "Need-based financial aid requires proof of financial status.",
    "Scholarship application forms are available on the Student Portal.",
    "Students should submit all required documents to complete their application.",
    "Scholarship award letters confirm approval and disbursement details.",
    "Financial aid applications are processed by the finance office.",
    "Scholarship disbursement is done according to university schedules.",
    "External scholarships may have additional requirements and deadlines.",
    "Students can apply for tuition aid to cover part of semester fees.",
    "Scholarship FAQs address common questions about eligibility and process.",
    "Scholarship renewal requires maintaining minimum academic performance.",
    "Government grants are available for qualifying students.",
    "Students may contact the scholarship office for assistance with applications.",
    "Scholarship program information sessions provide guidance on applications.",
    "Students should verify scholarship status on the portal regularly.",
    "Apply for fellowship opportunities as advertised by university or external bodies.",
    "Grant applications require submission of all supporting documents.",
    "Scholarship evaluation considers merit, need, and other criteria.",
    "Students may be required to attend interviews for certain scholarships.",
    "Scholarship resources and guides are available online for all students.",
    "Emergency aid applications are processed on priority basis.",
    "Scholarship approval letters contain terms and conditions of funding.",
    "Students must submit scholarship documents before the deadline.",
    "Scholarship management is coordinated by the finance and student affairs office.",
    "Student financial aid includes grants, bursaries, and emergency support.",
    "Scholarship portal login provides application tracking and updates.",
    "Scholarship announcements are posted on noticeboards and online portal.",
    "Scholarship help desk addresses all technical and procedural queries.",
    "Students should maintain copies of all scholarship documents.",
    "Financial support eligibility depends on academic performance and financial need.",
    "Scholarship verification ensures all criteria are met before disbursement.",
    "International scholarships require additional documentation for eligibility.",
    "Students may apply for multiple scholarships if eligible.",
    "Scholarship updates and changes are communicated via email and portal.",
    "Scholarship application process involves submission, review, and approval.",
    "Funding assistance may include tuition, accommodation, or living expenses.",
    "Students must follow scholarship guidelines to avoid disqualification.",
    "Scholarship program deadlines vary by type and eligibility.",
    "Apply for bursaries to cover partial or full semester fees.",
    "Scholarship award notice is the official confirmation of grant allocation.",
    "Students can seek guidance from financial aid office for scholarship queries.",
    "Scholarship evaluation includes review of submitted documents.",
    "Scholarship verification confirms authenticity of provided information.",
    "Students are encouraged to apply early to maximize chances of approval.",
    "Scholarship forms should be filled completely and accurately."
  ]
},
{
  "tag": "graduation_and_certificate",
  "patterns": [
    "Apply for graduation",
    "Graduation ceremony",
    "Degree certificate",
    "Transcript request",
    "Graduation requirements",
    "Verify graduation status",
    "Collect diploma",
    "Convocation details",
    "Graduation application form",
    "Degree verification",
    "Graduation eligibility",
    "Final year clearance",
    "Graduation documents",
    "Apply for transcript",
    "Request certificate",
    "Convocation schedule",
    "Graduation checklist",
    "Graduation fees",
    "Award of degree",
    "Diploma collection",
    "Graduation announcements",
    "Graduation portal",
    "Graduation registration",
    "Degree issuance",
    "Final year projects clearance",
    "Graduation support",
    "Certificate verification",
    "Graduation process",
    "Graduation notifications",
    "Graduation updates",
    "Request official transcript",
    "Graduation guidance",
    "Graduation rules",
    "Graduation requirements checklist",
    "Apply for convocation",
    "Graduation ceremony attendance",
    "Graduation status check",
    "Diploma authentication",
    "Degree collection process",
    "Graduation help desk",
    "Degree transcripts",
    "Certificate request form",
    "Graduation documentation",
    "Apply for degree verification",
    "Convocation registration",
    "Graduation eligibility confirmation",
    "Graduation office",
    "Graduation instructions",
    "Degree award ceremony",
    "Certificate issuance",
    "Graduation announcements portal",
    "Verify diploma"
  ],
  "responses": [
    "Students must apply for graduation once all requirements are fulfilled.",
    "Graduation ceremonies are scheduled annually and announced in advance.",
    "Degree certificates are issued upon successful completion of program requirements.",
    "Official transcripts can be requested through the Student Portal.",
    "Graduation eligibility is confirmed after final year clearance.",
    "Diplomas can be collected from the graduation office or convocation venue.",
    "Graduation application forms are available online for all students.",
    "Degree verification can be requested by employers or institutions.",
    "Students must clear all financial and academic obligations before graduation.",
    "Convocation details include venue, date, and attendance instructions.",
    "Graduation documents include certificates, transcripts, and clearance forms.",
    "Students should submit final year projects before graduation application.",
    "Graduation checklist ensures all requirements are met before convocation.",
    "Graduation fees must be paid before application approval.",
    "Award of degree is confirmed after approval by academic board.",
    "Diploma collection requires identification and confirmation of eligibility.",
    "Graduation announcements are posted on noticeboards and portal.",
    "Graduation portal provides forms, schedules, and guidelines.",
    "Graduation registration is mandatory for ceremony attendance.",
    "Degree issuance follows verification of all academic achievements.",
    "Final year clearance includes library, finance, and departmental approvals.",
    "Graduation support is provided by academic and administrative offices.",
    "Certificate verification ensures authenticity for official purposes.",
    "Graduation process involves application, approval, and documentation.",
    "Graduation notifications inform students of deadlines and requirements.",
    "Graduation updates are posted regularly on the Student Portal.",
    "Students can request official transcripts for employment or further studies.",
    "Graduation guidance helps students understand ceremony and documentation requirements.",
    "Graduation rules include dress code, attendance, and submission deadlines.",
    "Graduation requirements checklist helps track academic and administrative obligations.",
    "Apply for convocation online or in person before the deadline.",
    "Graduation ceremony attendance may require RSVP or registration.",
    "Graduation status can be checked through the portal or graduation office.",
    "Diploma authentication is available for employers or verification purposes.",
    "Degree collection process is coordinated by the academic office.",
    "Graduation help desk addresses queries regarding process and documentation.",
    "Degree transcripts are issued alongside the diploma or separately.",
    "Certificate request forms must be accurately completed to avoid delays.",
    "Graduation documentation is verified before issuing certificates.",
    "Apply for degree verification through the designated portal.",
    "Convocation registration ensures proper seating and participation.",
    "Graduation eligibility confirmation is mandatory before diploma issuance.",
    "Graduation office manages applications, ceremonies, and documentation.",
    "Graduation instructions include step-by-step application and attendance guidance.",
    "Degree award ceremony is the official event for diploma presentation.",
    "Certificate issuance follows verification of academic completion.",
    "Graduation announcements portal provides updates and deadlines.",
    "Verify diploma for authenticity before submitting to employers or institutions."
  ]
},
{
  "tag": "academic_support",
  "patterns": [
    "Academic advising",
    "Tutoring services",
    "Study groups",
    "Mentorship programs",
    "Academic guidance",
    "Faculty consultation",
    "Exam preparation help",
    "Student support center",
    "Learning resources",
    "Peer tutoring",
    "Academic counseling",
    "Study skills workshop",
    "Research assistance",
    "Writing center",
    "Math support",
    "Science lab assistance",
    "Course assistance",
    "Homework help",
    "Academic workshops",
    "Study strategy",
    "Learning support",
    "Faculty mentorship",
    "Assignment guidance",
    "Project help",
    "Academic success programs",
    "Exam strategy sessions",
    "Time management workshops",
    "Learning assistance",
    "Online academic support",
    "Study mentor",
    "Study advisor",
    "Faculty office hours",
    "Academic intervention",
    "Learning tutorials",
    "Research guidance",
    "Skill development sessions",
    "Study plan support",
    "Coursework guidance",
    "Study skills support",
    "Academic consultation",
    "Student academic help",
    "Faculty academic help",
    "Learning mentor",
    "Subject-specific tutoring",
    "Research project help",
    "Academic progress tracking",
    "Academic development",
    "Assignment support",
    "Study hall",
    "Student success support",
    "Academic coaching",
    "Study session scheduling",
    "Study resource portal"
  ],
  "responses": [
    "Academic advising helps students plan their course schedules effectively.",
    "Tutoring services provide support in specific subjects or skills.",
    "Study groups allow peer-to-peer learning and collaboration.",
    "Mentorship programs pair students with faculty or senior students for guidance.",
    "Academic guidance includes career, course, and research advice.",
    "Faculty consultations are available during office hours or by appointment.",
    "Exam preparation help includes practice tests and review sessions.",
    "Student support centers provide academic, personal, and career assistance.",
    "Learning resources include online materials, libraries, and workshops.",
    "Peer tutoring allows students to receive guidance from fellow students.",
    "Academic counseling addresses challenges in learning and study habits.",
    "Study skills workshops improve time management, note-taking, and test strategies.",
    "Research assistance is available for projects, papers, and theses.",
    "Writing centers support students in essay, report, and research writing.",
    "Math support includes tutoring, problem-solving sessions, and workshops.",
    "Science lab assistance helps students complete practical experiments effectively.",
    "Course assistance ensures understanding of lectures and materials.",
    "Homework help provides guidance on assignments without giving answers.",
    "Academic workshops focus on learning strategies and skills development.",
    "Study strategy sessions help plan for effective exam preparation.",
    "Learning support is available for students with special needs or learning difficulties.",
    "Faculty mentorship supports personal and professional development.",
    "Assignment guidance ensures students understand requirements and expectations.",
    "Project help assists students in planning and completing academic projects.",
    "Academic success programs aim to improve retention and achievement.",
    "Exam strategy sessions focus on effective test-taking techniques.",
    "Time management workshops teach prioritization and scheduling skills.",
    "Learning assistance is available online and in person.",
    "Online academic support includes virtual tutoring and resource access.",
    "Study mentors provide ongoing academic guidance and motivation.",
    "Study advisors help with course selection and academic planning.",
    "Faculty office hours allow one-on-one academic discussions.",
    "Academic intervention programs help struggling students improve performance.",
    "Learning tutorials provide step-by-step guidance on course materials.",
    "Research guidance supports students in conducting academic studies.",
    "Skill development sessions enhance academic, research, and professional skills.",
    "Study plan support helps students organize schedules and deadlines.",
    "Coursework guidance ensures students meet learning objectives.",
    "Study skills support improves comprehension, memory, and exam readiness.",
    "Academic consultation addresses individual learning challenges.",
    "Student academic help is available for all course-related queries.",
    "Faculty academic help provides subject-specific guidance.",
    "Learning mentors assist students in developing effective study habits.",
    "Subject-specific tutoring focuses on individual courses or topics.",
    "Research project help guides students through methodology and analysis.",
    "Academic progress tracking monitors performance and achievement.",
    "Academic development programs enhance learning and personal growth.",
    "Assignment support ensures understanding of instructions and deadlines.",
    "Study halls provide quiet spaces for focused learning.",
    "Student success support includes workshops, mentoring, and counseling.",
    "Academic coaching provides individualized academic improvement plans.",
    "Study session scheduling organizes group or individual review times.",
    "Study resource portal centralizes materials, guides, and support information."
  ]
},
{
  "tag": "facilities_and_services",
  "patterns": [
    "Library access",
    "Computer lab availability",
    "Wi-Fi support",
    "Printing services",
    "Campus security",
    "Transportation services",
    "Cafeteria hours",
    "Parking facilities",
    "Sports facilities",
    "Gym access",
    "Health center",
    "Maintenance requests",
    "Study rooms",
    "Dormitory services",
    "Laundry facilities",
    "IT support",
    "Equipment rental",
    "Conference rooms",
    "Audio-visual support",
    "Campus map",
    "Facility booking",
    "Accessibility services",
    "Recreational areas",
    "Student lounge",
    "Campus shuttle",
    "Lost and found",
    "Mailroom services",
    "Maintenance schedules",
    "Campus tours",
    "Library hours",
    "Computer lab hours",
    "Wi-Fi troubleshooting",
    "Printing request",
    "Campus safety protocols",
    "Transportation schedule",
    "Cafeteria menu",
    "Parking permit",
    "Sports club registration",
    "Gym membership",
    "Health checkup services",
    "Facility guidelines",
    "Study space reservation",
    "Dormitory allocation",
    "Laundry schedule",
    "IT troubleshooting",
    "Equipment borrowing",
    "Conference scheduling",
    "AV equipment rental",
    "Campus map download",
    "Accessibility support",
    "Recreational program registration",
    "Student lounge booking",
    "Shuttle timetable"
  ],
  "responses": [
    "Library access is available to all students but certain material is availabe to those with a valid Library card.",
    "Computer labs are open during official campus hours for student use.",
    "Wi-Fi support is available across campus; report issues to IT.",
    "Printing services are available in designated labs and library areas.",
    "Campus security ensures student safety and monitors entrances.",
    "Transportation services include shuttle buses and parking facilities.",
    "Cafeteria hours vary; menus are posted weekly on the student portal.",
    "Parking facilities require valid permits for campus areas.",
    "Sports facilities include courts, fields, and equipment for students.",
    "Gym access is granted with student membership or ID.",
    "Health centers provide medical consultation and basic treatment.",
    "Maintenance requests can be submitted via the campus portal.",
    "Study areas can be reserved in the library for personal reading.",
    "Dormitory services include housing allocation, maintenance, and rules.",
    "Laundry facilities are provided in dormitories or designated areas.",
    "IT support assists with software, hardware, and network issues.",
    "Equipment rental is available for labs, studios, and sports activities.",
    "Conference rooms can be booked for academic or student events.",
    "Audio-visual support is available for presentations and events.",
    "Campus maps are accessible online or at information desks.",
    "Facility booking requires online registration and approval.",
    "Accessibility services support students with special needs.",
    "Recreational areas provide outdoor and indoor activities.",
    "Student lounges offer spaces to relax, study, or socialize.",
    "Campus shuttles run on scheduled routes throughout the day.",
    "Lost and found is managed by campus security for reported items.",
    "Mailroom services handle packages, letters, and notifications.",
    "Maintenance schedules are posted for all campus facilities.",
    "Campus tours can be arranged through the admissions office.",
    "Library hours vary by day and during exam periods.",
    "Computer lab hours follow campus schedule and holidays.",
    "Wi-Fi troubleshooting is handled by IT help desk.",
    "Printing requests require student authentication and quotas.",
    "Campus safety protocols include emergency contacts and reporting procedures.",
    "Transportation schedule includes shuttles and inter-campus buses.",
    "Cafeteria menus are updated regularly to reflect available meals.",
    "Parking permits are issued via the campus parking office.",
    "Sports club registration is open each semester.",
    "Gym memberships can be activated using student ID at the front desk.",
    "Health checkup services are available periodically on campus.",
    "Facility guidelines ensure safety and proper use of resources.",
    "Study space reservations can be made online or at the library.",
    "Dormitory allocation follows student year, availability, and preferences.",
    "Laundry schedules are provided to all dorm residents.",
    "IT troubleshooting provides solutions for software, hardware, and connectivity issues.",
    "Equipment borrowing requires student ID and return by due date.",
    "Conference scheduling is coordinated with campus facilities office.",
    "AV equipment rental supports academic presentations and events.",
    "Campus map downloads are available from the official website.",
    "Accessibility support ensures all students have equal access to facilities.",
    "Recreational program registration is available via student portal.",
    "Student lounge booking can be done for club meetings or group study.",
    "Shuttle timetables are posted online and at shuttle stops."
  ]
}
  ]
}
